{
    "Query_0": {
        "1-10": [
            {
                "title": "AI Legitimacy for Sustainability",
                "abstract": "Sustainability is a vast subject involving various research areas. Emerging technologies, through their development and the possibilities they offer, impact sustainability. In particular, Artificial Intelligence and Machine Learning have been trendy research subjects for almost a decade now. They offer a wide range of potential applications, including energy efficiency and Intelligent Transportation Systems, two key elements for Smart Cities. All these developments seem to put AI in a favorable position to build Sustainability. However, AI’s own ecological impact and carbon footprint is disastrous and drastic changes must be done if this technology is to be used in a sustainable future. This paper offers a short overview of AI potential for sustainability, in the context of Smart cities. Then the drawbacks of AI energy consumption are highlighted. New ways and methodologies are proposed to create greener AI.",
                "eval": 1
            },
            {
                "title": "Estimation of Energy Performance Classes of Concrete Structures with Artificial Intelligence Models",
                "abstract": "The construction sector is one of the sectors that make energy efficiency a must. In almost every field related to the construction sector, there is a need for studies in which high performance can be achieved by including artificial intelligence in energy. In this study, energy class models, which are an area of artificial intelligence, which show the efficiency level of energy systems that determine the energy performance of buildings, are examined.",
                "eval": 1
            },
            {
                "title": "Explainable AI for predicting daily household energy usages",
                "abstract": "In the recent era, for most sustainable smart cities energy conservation is a major point of consideration as urbanization is been carried out at an exponential rate. Out of that most of the energy consumption is diverted toward households, and there is a huge scope for optimization of this energy. Hence predicting this household energy with the advancement of AI and Machine Learning techniques is considered a social contribution and area of interest for most researchers. But only predicting the energy consumption will not solve the problem of energy optimization for a city, it is also important to understand the factors responsible for such predictions so that all possible recourses could be carried out to those factors, and it becomes more accountable, trustworthy and justifiable its energy optimization decisions towards its all stakeholders. With the use of Explainable Artificial Intelligence (XAI) techniques such as LIME, SHAP is possible to improve the explainability of machine learning models. Here SHAP technique is adopted to understand the prediction model and identify mostly responsible factors for the energy consumption of households.",
                "eval": 1
            },
            {
                "title": "Sustainability Is Not Enough: Towards AI Supported Regenerative Design",
                "abstract": "Sustainability, to describe it in simpler words, is a process of making things less bad. It is not a long-term solution even if it limits the destruction of the environment to a manageable level. Nevertheless, by just becoming sustainable, one cannot bring back what has been lost. The restoration approach is immediately required to fixing what has been broken by using renewable energy, reforestation and creating biodiversity gains. Redesigning our industrial system of production and consumption around the circular patterns of resource and energy use that we observe in mature ecosystems is a must and a complex endeavour. To create a truly regenerative economy challenges us to work with huge amounts of data. New techniques of data science and artificial intelligence are required in each step of the ecological design. This paper presents some examples of biomimicry in circular design and proposes techniques that integrate data science and artificial intelligence (AI) as tools to accelerate the transition towards the regenerative approach. AI, as an emergent `Fourth Industrial Revolution' technology, can support and accelerate the pace of human innovation to design the future urban developments, to enable innovation in cities. AI has the capability to create a step change, to support an effective economic system that is regenerative by design.",
                "eval": 1
            },
            {
                "title": "Keynote: AI for Scientific Discovery and a Sustainable Future",
                "abstract": "Artificial Intelligence (AI) is a rapidly advancing field.Novel machine learning methods combined with reasoning and search techniques have led us to reach new milestones: from computer vision, machine translation, and Go worldchampion level play, to self-driving cars. These ever-expanding AI capabilities open exciting avenues for advances in new domains. I will discuss our AI research for advancing scientific discovery for a sustainable future. In particular, I will talk about our research in a new interdisciplinary field, Computational Sustainability, which aims to develop computational models and methods to help balance the environmental, economic, and societal needs for a sustainable future. I will provide examples of computational sustainability problems, ranging from biodiversity conservation to multi-criteria strategic planning of hydropower dams in the Amazon basin and materials discovery for renewable energy materials. I will also highlight our work on AI to accelerate the discovery of new solar fuels materials. In this work, we propose an approach called Deep Reasoning Networks (DRNets), which requires only modest amounts of (unlabeled) data, in sharp contrast to standard deep learning approaches. DRNets reach superhuman performance for crystal-structure phase mapping, a core, long-standing challenge in materials science, enabling the discovery of solar-fuels materials. DRNets provide a general framework for integrating deep learning and reasoning for tackling challenging problems. Finally, I will highlight cross-cutting computational themes and challenges for AI",
                "eval": 1
            },
            {
                "title": "Investigating the Energy Production through Sustainable Sources by Incorporating Multifarious Machine Learning Methodologies",
                "abstract": "Artificial Intelligence (AI) has the potential to revolutionize the way we predict and manage energy generation from solar and wind sources. It can greatly enhance the accuracy and scalability of energy prediction in solar and wind power systems. The implementation of advanced machine learning techniques can optimize the performance of these renewable energy systems and predict the variability of energy production. AI-powered algorithms can analyze data from various sources such as weather forecasts and historical energy production data to predict energy generation with increased precision, allowing for optimization of the system's operation. Furthermore, AI can also predict energy demand and adjust energy production, accordingly, resulting in reduced energy waste and increased system efficiency. As the demand for renewable energy continues to rise, the integration of AI in this field becomes increasingly crucial in ensuring a sustainable and dependable energy future. In this research, we investigate the utilization of AI techniques for evaluating the generation of hydrogen from solar and wind power. The results of this study will provide insight into the potential of AI tools for forecasting hydrogen production from solar and wind energy. The amount of hydrogen produced from solar energy is up to 93.3 × 10<sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">3</sup>kg/km<sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</sup>whereas estimated production from wind is 6.7 kg/day. The comparison of the performance of the different machine learning models used in the study will help to identify the most effective method for forecasting hydrogen production in this context. Additionally, the study aims to contribute to the growing body of knowledge on the application of AI in the field of renewable energy and its potential to improve the efficiency, scalability, and reliability of energy systems.",
                "eval": 1
            },
            {
                "title": "Data analytics to increase efficiency of the AI based energy consumption predictor",
                "abstract": "These days most of the developed countries have been focusing on energy consumption forecasting. The smart management of energy became the key note for many researchers in aspects of better understanding of the complex pattern of energy production, distribution and utility line. The AI based smart predictor mainly depends on the huge historical data analytics along with a set of modelling algorithms to specify each logical part. In this paper we have discussed about the core data analytics and the manual evaluation to capture the exact patterns from a real time versatile building energy consumption dataset which could be utilized in the implementation of an AI based smart predictor. With high dimensional data visualization and data analytics we were able to attain relatively lower mean absolute error i.e. a reduction of error up to 40.22% in the data pre-processing phase. We have mainly focused on the handling of the real time energy consumption data set and to trace out the energy supply or consumption breakdown conditions. From a publicly available data set, various data pre-processing criteria have taken and prepared the data-frame for the multivariate prediction model. After data pre-processing linear regression has been used to predict the energy consumption per carpet area and the prediction efficiency has been compared for each cases. With the manual evaluation and the tracing of energy breakdown or any other unusual condition, the prediction performance increased up to 31.03%.",
                "eval": 1
            },
            {
                "title": "Wind Turbine Power Output Forecasting Using Artificial Intelligence",
                "abstract": "In this paper, wind turbine power output is predicted using Artificial intelligence (AI) techniques. The AI techniques used for predictions are Machine Learning (ML) algorithm and Deep Learning (DL). In ML, polynomial regression is used and Long Short Term Memory(LSTM) was used in DL. This forecasting is long-term forecasting that uses three years of data collected from NIWE (National Institute of Wind Energy) and the results can be used directly for the planning of energy management. Various environmental factors were taken into consideration for forecasting for better accuracy and results. The AI helps to predict the wind turbine output with high accuracy by considering the linear and non-linear types of dataset. This technique can also be used for the preventive maintenance of wind turbines and before the installation of wind power plants in an unfamiliar place to determine the corresponding wind potential.",
                "eval": 1
            },
            {
                "title": "The Use of Intelligent Vehicles and Artificial Intelligence in Mining Operations: Ethics, Responsibility, and Sustainability",
                "abstract": "This letter is resulted from IEEE TIV's Decentralized and Hybrid Workshops (DHW) on Autonomous Mining (AM). We have already conducted 2 distributed/decentralized and hybrid symposia (DHS), 5 DHWs, and more than 10 seminars on AM in the past year. The following is a brief summary on the key components from our DHS, DHWs, and Seminars about ethics, responsibility, and sustainability in intelligent vehicles (IVs) and artificial intelligence (AI) for AM (Wang, 2022), (Cao et al., 2022).",
                "eval": 0
            },
            {
                "title": "Keynote 2 - Computational Sustainability: Computing for a Better World and a Sustainable Future",
                "abstract": "Summary form only given, as follows. The complete presentation was not made available for publication as part of the conference proceedings. Artificial Intelligence (AI) is a rapidly advancing field. Novel machine learning methods combined with reasoning and search techniques have led us to reach new milestones: from computer vision, machine translation, and Go and Chess world-champion level play using pure self-training strategies, to self-driving cars. These ever-expanding AI capabilities open up new exciting avenues for advances in new domains. I will discuss our AI research for advancing scientific discovery for a sustainable future. In particular, I will talk about our research in a new interdisciplinary field, Computational Sustainability, which has the overarching goal of developing computational models and methods to help manage the balance between environmental, economic, and societal needs for a sustainable future. I will provide examples of computational sustainability problems, ranging from biodiversity and wildlife conservation, to multi-criteria strategic planning of hydropower dams in the Amazon basin and materials discovery for renewable energy materials. I will also highlight cross-cutting computational themes and challenges for AI at the intersection of constraint reasoning, optimization, machine learning, multi-agent reasoning, citizen science, and crowd-sourcing.",
                "eval": 1
            }
        ],
        "21-30": [
            {
                "title": "Tech Mining Analysis: Renewable Energy Forecasting Using Artificial Intelligence Technologies",
                "abstract": "Extracting useable information from large and complex data is one of the challenges that can be solved by data mining. The use of data mining to understand the state of research fields and the underlying technologies which are related in intricate ways is known as bibliometric analysis or \"tech mining\". Tech mining can help in summarizing the important research results that are valuable to researchers, industry, and decision-making. Furthermore, tech mining can be useful in showing the trends and relations of the analyzed topic. Hence, the purpose of this research is to investigate the status and the evolution of scientific studies in the field of renewable energy forecasting using Artificial Intelligence (AI) technologies. The study seeks to address the status of the scientific production indexed in Scopus based on scientometrics indicators. In total, over 25000 articles were extracted. The collected data were analyzed using R software packages. The findings show the exponential growth of this topic in the past 10 years. The most relevant sources, authors, affiliations, and countries were found. Moreover, the most recent trends and technologies were stated. It was also found that the interest in this research topic is prevalent in Asian countries especially China which has the highest number of publications and citations. Moreover, it was found that the most fund for research in this domain comes from Chinese institutions.",
                "eval": 1
            },
            {
                "title": "Artificial Intelligence for Smart Renewable Energy Sector in Europe—Smart Energy Infrastructures for Next Generation Smart Cities",
                "abstract": "One of the most challenging areas of Future Smart Cities Research is the Smart Energy domain. Critical issues related to optimization, provision of smart customizable networks and sophisticated computational techniques and methods enabled by artificial intelligence and machine learning need further investigation. The renewable energy (RE) is a powerful resource for the future global development in the context of climate change and resources depletion. Artificial intelligence (AI) implies new rules of organizing the activities in order to respond to these new requirements. It is necessary to improve the design of the energy infrastructure, the deployment and production of RE in order to face the multiple challenges that will affect the sector’s growth and resilience.. In this research work we exploit the recent developments on the AI adoption for RE sector in European Union (EU). In this respect, we analysed (i) the efficiency of the transformation processes of the RE within the energy chain from Gross Inland Consumption to Final Energy Consumption, (ii) its implications on the structure of renewable energy by source (solar, wind, biomass etc.), (iii) the labour productivity in RE sector compared to the economy as a whole and its correlation with investments level, (iv) the implication of the adoption of AI for RE towards Future Smart Cities Research. The main contribution of this research is the development of a framework for understanding the contribution of AI in the RE sector in Europe. Another bold contribution of this work is the discussion of the implications for Future Smart Cities Research and future research directions.",
                "eval": 1
            },
            {
                "title": "Supply Chain Energy Sustainability with Artificial Intelligence",
                "abstract": "Supply chain (SC) processes are complex and have been the subject of many optimization studies. The optimization of the SC is pivotal for the success of a business. optimizing SC usually requires rapid responses and additional resources, resulting in increased energy demand that in turn yields augmented CO<inf xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</inf> emission. The advent of the Artificial Intelligence (AI) has delivered alternative optimization opportunities when adopted as a digital tool. This research provides insights into AI application for optimizing SC processes in order to decrease energy demand and CO<inf xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</inf> emission. The AI engine is based on a Cyber Physical System (CPS) developed using business activities as defined by business processes. A Monte Carlo simulation is adopted to ensure that the baseline (CPS) model is statistically representative. The probability functions and results of2400 runs are extracted and inputted into Python code to generate ordinary least square (OLS) multiple linear regression model. The results of the OLS are used to create energy optimization formula to reduce CO<inf xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</inf> emission and yield sustainable energy in the SC.",
                "eval": 1
            },
            {
                "title": "The use of machine learning (ML) in sustainable systems-An Overview",
                "abstract": "Machine learning has the ability to dramatically improve sustainable systems by anticipating needs, maximizing resource use, raising output, and lowering waste. An overview of earlier studies on the incorporation of machine learning into sustainable systems is presented together with a case study of how machine learning was used to lower energy use in a residential structure. The results show that machine learning may be used to increase energy efficiency and save a lot of money. Wearable technology has added a whole new dimension to the already vast field of personal electronics. The mobile phone gave devices their true individuality. Because so many services are designed around mobile phones, the market has opened up for a brand-new personalized experience utilizing wearable technologies. Fabric sensors may now be combined with wearable microcontrollers like the flora and lily pad to monitor stretch, pressure, bend, and even the direction that the body is being braced. The connections between them are based on conductive threads that follow the curve of the fabric. We'll examine how different teams used their in-depth understanding of wearable technologies to accomplish their goals in this study.",
                "eval": 1
            },
            {
                "title": "Intelligent Energy Management for a Building DC Nanogrid",
                "abstract": "Nowadays, the world is subject to the development of science and technology, transforming all the old systems into new and more efficient ones, and power grids are the perfect example of this development. Conventional power grids are a source of frequent problems, including line losses that cause instability in the distribution of electricity and a huge impact on the environment, causing damage related to climate change. Addressing these problems is seen as an action to achieve sustainable development goals, to ensure a better future. Energy plays a role in improving these goals, which makes automation a very important tool for establishing a more intelligent and reliable distribution. Among these solutions are DC nanogrids, which have the ability to generate energy using their own renewable resources, even in remote areas thanks to artificial intelligence. They can be automatically regulated to prevent energy shortages. This work aims to intelligently manage the distribution of energy produced by several renewable sources in a DC nanogrid. To solve this problem and to ensure a good energy management we have opted to use Fuzzy logic method as artificial intelligence element that controls the energy management in the nanogrid. The simulation results obtained from the proposed algorithm show that it is able to effectively manage the balance between the renewable energy power produced by the nanogrid without causing power imbalance or disruption of the overall system.",
                "eval": 1
            },
            {
                "title": "Artificial intelligence technologies in business and engineering",
                "abstract": "Artificial intelligence (AI) is making its way back into the mainstream of corporate technology, this time at the core of business systems which are providing competitive advantage in all sorts of industries, including electronics, manufacturing, marketing, human resource, financial services software, medicine, entertainment, engineering and communications. Designed to leverage the capabilities of humans rather than replace them, today's AI technology enables an extraordinary array of applications that forge new connections among people, computers, knowledge, and the physical world. Some AI enabled applications are information distribution and retrieval, database mining, product design, manufacturing, inspection, training, user support, surgical planning, resource scheduling, and complex resource management. AI technologies help enterprises reduce latency in making business decisions, minimize fraud and enhance revenue opportunities.",
                "eval": 0
            },
            {
                "title": "Cloud Edge Architecture Leveraging Artificial Intelligence and Analytics for Microgrid Energy Optimisation and Net Zero Carbon Emissions",
                "abstract": "Microgrids and energy platforms have become increasingly intricate in nature. This is especially true in platforms adopted in large multi functional complexes which are spread across geographies of varying climactic conditions. Many of these complexes have evolved over time as organisations have grown and diversified, this has resulted in a mix of infrastructure, technology, networks, systems and equipment woven in an inextricable web. Often managing such complex hierarchies involve interacting with heterogeneous management platforms from various vendors and built on different platforms each providing the solution to a piece of the ’energy puzzle’ of the organisation. The complexities involved in managing such a network of systems are manifold and require extensive resourcing and expertise. Sustainability and Net Zero carbon emission initiatives that aim to achieve international and national targets add a further layer of complexity to the task at hand. In this paper, we propose a Cloud Edge architecture that leverages Artificial Intelligence (AI) and data analytics for microgrid energy optimisation and net zero carbon emissions. This architecture provides an intelligent and cohesive abstraction to assist in cataloging, unifying and managing the complexities of microgrids and enabling sustainable management of energy. The proposed architecture has been operationalised as the energy management and optimisation platform at a multi-campus, multi-functional tertiary education institution. Empirical evaluations conducted on this deployment have generated results that confirm the function and effectiveness of this architecture in addressing the emerging and evolving challenges of microgrid energy optimisation and net zero carbon emissions.",
                "eval": 1
            },
            {
                "title": "Applications of Smart Technologies Regarding Promoting Energy Efficiency and Sustainable Resource Utilization",
                "abstract": "Smart pieces of machinery are probable to perform and progressively indispensable besides valuable character in lecturing today’s foremost populace concerns besides arranging the underpinning aimed at an additional sustainable society. The fundamental problem nowadays is alleviating the impressions of climate change, although confirming societal social prosperity remains sustainable. Strong coordination amongst all relevant engineering specialties is required to develop interdisciplinary linkages and thus transcend complicated technical challenges. Extensive experimental activities are aimed at equitable capacity utilization, sustainable power-associated requirements, renewable energy organization incorporation, appropriate responses to empower a corporate sustainability foundation, effective performance assimilation, and perhaps other things that matter to that same inhabitants. Increased competition, effectiveness, a shortage of information essential for optimal allocation, and shifting price and quantity trends pose problems to the energy market. Ai technology is incorporated into renewable technology, including predicting electricity, power efficiency, and availability. Choosing the ideal customer to respond again for traits but also needs affordable pricing, planning, controlling infrastructure, rewarding power storage members, and rewarding people evenly and financially are all ways to tackle various issues. This article introduces fresh concepts and examines current difficulties and problems that must contribute to a more sustainable tomorrow based on intelligent technology. The primary outcomes of such an introductory article are a conversation of numerous products and approaches that will direct to more advancement on a variety of topics, including improved efficiency, sustainable and efficient strategic planning, pollution prevention ideas, as well as a conversation of possible steps that will contribute to a healthy long term.",
                "eval": 1
            },
            {
                "title": "Artificial Intelligence as a Driver of Industrial Competitiveness",
                "abstract": "Beyond our wildest dreams, Artificial Intelligence (AI) is changing industrial growth as well as our mode of living. Numerous nations have started national AI programmes to promote the value and usefulness of AI in smart businesses. However, there are problems with the practical use of AI to address current manufacturing concerns that must be disregarded. Finding various applications that may deliver value and satisfy the rising market but also capital demands is now the largest issue. To provide a concise road map for the methodical development and integration of AI in industrial operations, a systematic framework termed as \"Industrial AI\" was presented along with its key enabling technologies. This paper provides a thorough review of the major enabling solutions for industrial AI throughout the manufacturing sector as a whole and how their systematic implementation will help create new opportunities for value creation and prevent issues from emerging yet.",
                "eval": 0
            },
            {
                "title": "ACP-Based Energy-Efficient Schemes for Sustainable Intelligent Transportation Systems",
                "abstract": "Reducing vehicle exhaust pollution and energy consumption is of great significance for improving the sustainability of social development. Currently, most energy-efficient and regenerative energy recovery methods are from a vehicle control perspective, ignoring the impact on the overall traffic environment. An important reason is that the transportation system's large scale, complexity and social nature restrict its energy-efficient development. Hence, this letter proposes energy-efficient and regenerative energy recovery schemes for sustainable intelligent transportation system using the Artificial societies, Computational experiments, Parallel execution (ACP) framework. The framework includes three parts: energy-efficient oriented intelligent road infrastructure design, transportation traffic flow and vehicle velocity profile planning co-design, and cloud-based vehicle engine parameter calibration. This letter is the second part of Distributed/Decentralized Hybrid Workshop on Sustainability for Transportation and Logistics (DHW-STL) and aims to enhance the sustainability of transportation system from the energy-efficient perspective.",
                "eval": 0
            }
        ],
        "51-60": [
            {
                "title": "Deep Learning in Energy Modeling: Application in Smart Buildings With Distributed Energy Generation",
                "abstract": "Buildings are responsible for 33% of final energy consumption, and 40% of direct and indirect CO<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</sub> emissions globally. While energy consumption is steadily rising globally, managing building energy utilization by on-site renewable energy generation can help responding to this demand. This paper proposes a deep learning method based on a discrete wavelet transformation and long short-term memory method (DWT-LSTM) and a scheduling framework for the integrated modelling and management of energy demand and supply for buildings. This method analyzes several factors including electricity price, uncertainty in climatic factors, availability of renewable energy sources (wind and solar), energy consumption patterns in buildings, and the non-linear relationships between these parameters on hourly, daily, weekly and monthly intervals. The method enables monitoring and controlling renewable energy generation, the share of energy imports from the grid, employment of saving strategy based on the user priority list, and energy storage management to minimize the reliance on the grid and electricity cost, especially during the peak hours. The results demonstrate that the proposed method can forecast building energy demand and energy supply with a high level of accuracy, showing a 3.63-8.57% error range in hourly data prediction for one month ahead. The combination of the deep learning forecasting, energy storage, and scheduling algorithm enables reducing annual energy import from the grid by 84%, which offers electricity cost savings by 87%. Finally, two smart active buildings configurations are financially analyzed for the next thirty years. Based on the results, the proposed smart building with solar Photo-Voltaic (PV), wind turbine, inverter, and 40.5 kWh energy storage has a financial breakeven point after 9 years with wind turbine and 8 years without it. This implies that implementing wind turbines in the proposed building is not financially beneficial.",
                "eval": 1
            },
            {
                "title": "Proposal of smart home resource management for waste reduction and sustainability using AI and ML",
                "abstract": "A research indicated that electricity is obliterating extra non-renewable sources for its production. In that, as per Centre for Policy Research (CPR), about 25% of the total production is diverted to meet the daily consumption in an Indian household. Not only this but also, waste management has become an important issue to deal with. According to Municipal Solid Waste (MSW) of India, waste generation in Indian urban communities extends between 200 - 870 grams per day, contingent on the localities' standard of living and the area of the city. Therefore, in this paper we propose a concept that focuses on a sustainable solution using Artificial Intelligence and Machine Learning algorithms for waste and carbon footprint reduction in a home. This concept explains a solution availed with the help of a proposed model called Home Resource Management (HoReM) that is imbibed in a Smart home.",
                "eval": 0
            },
            {
                "title": "Application of Transaction Minimization Artificial Intelligent Algorithm for Weblog Analysis",
                "abstract": "Web logs files are analyzed using several kinds of Al and web mining techniques such as web, and data mining in order to extract useful information and utilized them for future purposes. The existing web log files suffer from many drawbacks. An AI-inspired algorithm and cluster-based ranking mechanism have been designed that overcomes the drawback. This paper presents the cluster based ranking mechanism and transaction minimization algorithm in detail in the proposed web log files.",
                "eval": 0
            },
            {
                "title": "From independence to interconnection — A review of AI technology applied in energy systems",
                "abstract": "The development of diversified energy structures, distributed energy scheduling models and active participation ability of users, leads to a rapid movement toward energy system in which different energy carriers and systems interact together in a synergistic way. This energy development will face many challenges with the requirements of big data processing capability, professional skill, distributed collaboration and realtime monitoring for the energy system that demands an intelligent and flexible tool to realize the smart energy. Artificial intelligence (AI) technology has become a focus because of its better performance. This paper proposed a classification method that incorporates the intelligence of an independent energy unit (IEU) and the intelligence among interconnected energy units (IEUS) to review the development of AI technology in energy systems. The dominant structures of IEU can be considered from three aspects including perception, decision and implementation to study the optimal strategy for AI methods utilized in IEU. And considering the interaction relationship of IEUS, the AI applied for it can be described by the coordinated relationship and adversarial relationship problems to achieve consensus. By discussing the AI technologies and the potentials of AI in the energy system, some suggestions are presented to improve intelligent technologies for sustainable energy systems in the future.",
                "eval": 1
            },
            {
                "title": "Exploring Energy-Accuracy Tradeoffs in AI Hardware",
                "abstract": "Artificial intelligence (AI) is playing an increasingly significant role in our everyday lives. This trend is expected to continue, especially with recent pushes to move more AI to the edge. However, one of the biggest challenges associated with AI on edge devices (mobile phones, unmanned vehicles, sensors, etc.) is their associated size, weight, and power constraints. In this work, we consider the scenario where an AI system may need to operate at less-than-maximum accuracy in order to meet application-dependent energy requirements. We propose a simple function that divides the cost of using an AI system into the cost of the decision making process and the cost of decision execution. For simple binary decision problems with convolutional neural networks, it is shown that minimizing the cost corresponds to using fewer than the maximum number of resources (e.g. convolutional neural network layers and filters). Finally, it is shown that the cost associated with energy can be significantly reduced by leveraging high-confidence predictions made in lower-level layers of the network.",
                "eval": 0
            },
            {
                "title": "Investigating the Energy Production Trends of Countries and Its Relationship Between Economic Development",
                "abstract": "There are three main energy resources for energy production that is currently used by the countries can be listed as fossil fuels, renewable energy, and nuclear energy. Since the industrial revolution, the fundamental energy resource of the world is fossil sources. Due to their problems such as greenhouse gas emissions, production cost, etc., fossil fuels are not sustainable sources in terms of world ecology and economy. Developed countries of the world focused on using alternative energy resources like renewable energy and nuclear energy to produce green and sustainable energy for a better future. An assumption might be made about the relationship between the types of energy resources used by a country and its development level. In this study, we investigate the connection between the economic development of the countries and energy consumption patterns using a machine learning approach. We used a custom data set created by the combination of two separate data sets to deduce that relation by using the clustering method. It can be seen that developed countries are prone to cease the usage of fossil fuels and increase the energy produced by renewable and nuclear energy while underdeveloped or developing countries still rely mostly on fossil fuels. This trend among the developed countries has increased by the year. Additionally, we also wanted to see where Turkey stands among the selected countries and make an observation on its energy and economic development progress.",
                "eval": 0
            },
            {
                "title": "Economic analysis of the energy saving and emission reduction",
                "abstract": "He Essence of the Scientific Outlook on Development is the thought of sustainable development. One of the biggest challenges of sustainable development for China is how to respond to the constraint of the energy and environment to realize a harmonious society. Energy saving and emission reduction is necessary to maintain long-term sustainable economic development. In this respect, a following options are taken into a consideration: Energy efficiency; new and renewable energy sources; property right system establishment; Fees for discharge of collection; pollution-discharge right trade and so on. It is also necessary to take industrial ecology and green GDP accounting system. Economic analysis of the energy saving and emission reduction provide theoretical basis for achieving comprehensive, coordinated and sustainable development.",
                "eval": 0
            },
            {
                "title": "Novel AI Based Energy Management System for Smart Grid With RES Integration",
                "abstract": "The different energy assets such as solar panels and batteries help electrical engineers to manage and meet the increasing demand. The amalgamation of renewable energy resources with artificial intelligence is the key focus of providing high energy efficiency with alternative sources. This solution will not only meet electricity demand but also help in reducing greenhouse gas emissions as a result the efficient, sustainable and eco-friendly solution can be achieved which would contribute a lot to the smart grid environment. Here, a modified grey wolf optimizer approach is utilized to develop a novel energy management system for SPV-based microgrid considering modern power grid interactions. The proposed approach aims to provide a proficient microgrid that utilizes solar photovoltaic technology, and energy storage systems using an artificial intelligence algorithm-based microgrid control for optimal dispatch of energy in grid-connected systems. The performance of this novel energy management system is validated under sunny day and cloudy day, to emulate the stochastic nature of solar photovoltaic systems. A comparative study with mixed linear programming is also conducted that indicates towards the savings in 23.34% and 45.55% of the rolling cost for a clear and cloudy day respectively.",
                "eval": 1
            },
            {
                "title": "Artificial Intelligence-based Irradiance and Power consumption prediction for PV installations",
                "abstract": "Currently, several countries are seeking to change their energy matrices towards more sustainable sources. In Chile, one of the renewable sources with increased participation is photovoltaics. However, photovoltaic energy sources have an intrinsic variability, which combined with variable demand imposes a challenge for proper design. Currently, tools available for the study of this variability are either complex or expensive. With the advent of digitalization, there is an opportunity to incorporate tools based on Artificial Intelligence to improve forecasting for medium and low power installations. This work presents an application of machine learning tools for irradiance and power consumption forecasting. The methodology is intended to be implemented as a low cost solution for small scale generation. The results show that it is possible to predict irradiance and energy consumption through historical data, concluding that the methodology based on Machine Learning is able to support the decision making for the improvement of photovoltaic systems.",
                "eval": 1
            },
            {
                "title": "Significance of Emerging Technological Advancements in Transition of Green Economy",
                "abstract": "UNEP’s SDGs agenda 2030 focuses on the reduction of negative environmental impacts to achieve green economy. Industry 4.0 calls for energy efficient and clean energy technologies as a solution to reduce the impacts of global warming and climate change to achieve Sustainable Development Goals set by United Nations Environment Programme. United Nations Environment Programme is promoting green economy as an alternative solution to achieve sustainable development. Exponential technologies have a significant Role in achieving all the Sustainable Development Goals. United Nations Environment Programme in its report on ‘Technology and innovation’ has expected that by the year 2025, the market growth of technologies would be ${\\$}$3.2 trillion. In this regard study covers the frontier technologies- Artificial Intelligence (AI) and Machine Learning, the Internet of things (IoT), Big Data Analytics and Block chain. The present study is related to SDG 8 and 9. This paper analyzes the significance of technological advancements for green economy. The study analyzes that technological advancements have a significant Role in sustainable developmental aspects. Therefore, to attain green economy, there is a need to encourage research and innovation on energy and environment.",
                "eval": 1
            }
        ],
        "101-110": [
            {
                "title": "Study on Machine Learning based Energy Efficiency in Developed Countries",
                "abstract": "The increase in energy consumption has seen a huge bump in the past few decades. The credit goes to extensive urbanization and globalization. Forecasting the amount of energy consumption helps in sustainable development and making cost-efficient decisions. The recent studies have revealed that uncontrollable energy demand can be faced in upcoming decades. This produces an alarming situation and various researchers have been working towards energy consumption by adopting various methods. This article presents a comprehensive review of the various researchers' contribution to forecasting the energy demand for various resources. This article apprises the multiple machine learning techniques adopted to study the real data using time series models. An in-depth review of efficient resource allocation and consumption in cloud computing has also been included. Various statistics have been presented as the ground of comparing the performance of various proposed models with the state-of-the-art.",
                "eval": 1
            },
            {
                "title": "Artificial Intelligence Based Hybrid Forecasting Approaches for Wind Power Generation: Progress, Challenges and Prospects",
                "abstract": "Globally, wind energy is growing rapidly and has received huge consideration to fulfill global energy requirements. An accurate wind power forecasting is crucial to achieve a stable and reliable operation of the power grid. However, the unpredictability and stochastic characteristics of wind power affect the grid planning and operation adversely. To address these concerns, a substantial amount of research has been carried out to introduce an efficient wind power forecasting approach. Artificial Intelligence (AI) approaches have demonstrated high precision, better generalization performance and improved learning capability, thus can be ideal to handle unstable, inflexible and intermittent wind power. Recently, AI-based hybrid approaches have become popular due to their high precision, strong adaptability and improved performance. Thus, the goal of this review paper is to present the recent progress of AI-enabled hybrid approaches for wind power forecasting emphasizing classification, structure, strength, weakness and performance analysis. Moreover, this review explores the various influential factors toward the implementations of AI-based hybrid wind power forecasting including data preprocessing, feature selection, hyperparameters adjustment, training algorithm, activation functions and evaluation process. Besides, various key issues, challenges and difficulties are discussed to identify the existing limitations and research gaps. Finally, the review delivers a few selective future proposals that would be valuable to the industrialists and researchers to develop an advanced AI-based hybrid approach for accurate wind power forecasting toward sustainable grid operation.",
                "eval": 1
            },
            {
                "title": "A study of Artificial Intelligence in behavioural education",
                "abstract": "The research field of Artificial Intelligence in Education (AIED) embraces a wide diversity of research interests. Psychology, education and cognitive science are strongly represented; alongside computer science and artificial intelligence . The form of \"intelligence\" that people want their young to have can take several forms. This paper is concerned with how motivationally intelligent systems can stimulate, maintain and improve the student's desire and capability to learn. The special goal of Motivationally Intelligent Systems is to maintain or even increase the learner's desire to learn and their willingness to expend effort in undertaking the, sometimes hard, activities that lead to learning. Such a goal is in addition to, but intertwined with, the more traditional educational system goals of offering information, activities and support for learning new knowledge and skills.",
                "eval": 0
            },
            {
                "title": "Application of RBF Neural Network in the Construction of Intelligent Predictive Model of Public Building Energy Consumption",
                "abstract": "Energy saving and emission reduction are necessary means for our country to take the road of sustainable development. It requires the control of social energy usage and the active development of a low-carbon economy. For the sake of make a scientific prediction of structure energy usage, an intelligent forecasting model for public structure energy usage is constructed in accordance with RBF, and optimized by combining PSO algorithm and LM (Levenberg-Marquardt) algorithm. The results show that the SPO-LM-RBF forecasting model can get reasonable and accurate forecasting results of structure energy usage in both cooling season and heating season, the forecasting error is controlled below 2.1%, the average relative error is reduced by 2.24% and 1.33% compared with RBF neural network, and the daily maximum relative error is decreased by 4.75% and 3.76%, which is important to implement energy conservation and emission reduction of public structures.",
                "eval": 1
            },
            {
                "title": "Technology transfer for renewable energy development and use in Africa",
                "abstract": "Renewable energy is a crucial factor if sustainable development on the continent of Africa is to be given the priority it deserves. The technologies for achieving this however mainly exist outside its geographical boundaries. This makes the issue of technology transfer quite pertinent.",
                "eval": 0
            },
            {
                "title": "Blockchain-Based Incentive Energy-Knowledge Trading in IoT: Joint Power Transfer and AI Design",
                "abstract": "Recently, edge artificial intelligence techniques (e.g., federated edge learning) are emerged to unleash the potential of big data from Internet of Things (IoT). By learning knowledge on local devices, data privacy preserving and Quality of Service (QoS) are guaranteed. Nevertheless, the dilemma between the limited on-device battery capacities and the high energy demands in learning is not resolved. When the on-device battery is exhausted, the edge learning process will have to be interrupted. In this article, we propose a novel wirelessly powered edge intelligence (WPEG) framework, which aims to achieve a stable, robust, and sustainable edge intelligence by energy harvesting (EH) methods. First, we build a permissioned edge blockchain to secure the peer-to-peer (P2P) energy and knowledge sharing in our framework. To maximize edge intelligence efficiency, we then investigate the wirelessly powered multiagent edge learning model and design the optimal edge learning strategy. Moreover, by constructing a two-stage Stackelberg game, the underlying energy-knowledge trading incentive mechanisms are also proposed with the optimal economic incentives and power transmission strategies. Finally, simulation results show that our incentive strategies could optimize the utilities of both parties compared with classic schemes, and our optimal learning design could realize the optimal learning efficiency.",
                "eval": 0
            },
            {
                "title": "Research on the application of artificial intelligence technology in the carbon footprint of power equipment",
                "abstract": "The low-carbon development of the power industry is a broad energy revolution. The essence of the revolution lies in the innovation of technology and methods. In recent years, with the wide application of Internet, big data, artificial intelligence and other technologies, a wave of technological innovation in the industry has been set off. How to use advanced digital technology to combine with production equipment and production processes to improve energy efficiency and production efficiency, save energy and reduce consumption, reducing carbon emissions has become the focus of the power industry. This paper aims to introduce a monitoring mechanism for power equipment from the perspective of the production side, and combine digital technologies such as artificial intelligence and big data to achieve the coverage of power generation equipment, power transmission and transformation equipment, power electronic equipment and other power equipment industries to improve power transmission efficiency, Power production efficiency, thereby reducing greenhouse gas emissions and promoting the low-carbon transformation of the power industry.",
                "eval": 1
            },
            {
                "title": "SECTOR-COUPLED ENERGY SYSTEMS USING THE FLEXIBILITY OF SMART DSM",
                "abstract": "Linked to the 3D challenges of the energy transition (decarbonisation, decentralization and digitization) are the integrated planning and operation of distribution networks and supply infrastructure. Increasing shares of renewable energies are forcing the use of new flexibilities for maintaining the resilience and stability of the power grid. Important components of such flexibility options are the use of multi-commodity systems (sector coupling) and Smart DSM. Activating the flexibility of smart demand side applications is key for a sustainable, reliable energy system. In FUSE (FUture Smart Energy), a German-Finnish R&D project, AI-based DSM methods are developed to increase the resilience of distribution grids, considering multi-energy applications and local network conditions. The methods are evaluated in a Smart Grid laboratory, principles are integrated into an optimization framework for planning system design and operation. The project is ongoing, hence results are subject to update. The DSM methods are based on automated generation of soft-control signals enabling dynamic, decentralized control of consumers based on energy availability. Consumers include either buffer storage or process flexibility, or both, with the latter being transformed into the former. First results of the controller testing in the power hardware/software Smart Grid laboratory are promising, with further investigation needed.",
                "eval": 1
            },
            {
                "title": "A New Area Towards to Digitalization of Energy Systems: Enables, Challenges and Solutions",
                "abstract": "With the ever-increasing energy demand, the electric power sector and the energy industry are promoted to decentralization, decarbonization and digitalization. The digital platforms gradually become a megatrend for a clean energy system. Digitalization of the energy systems has conducted changes in various dimensions such as energy savings, sustainability and security. In this paper, the impact of digitalization on the electric energy systems, electric vehicles (EVs), sustainable development goal (SDGs) and greenhouse gas (GHG) emissions are analyzed and investigated. A systematic overview and discussions on the key drivers for digitalization and decentralization of energy systems are addressed. This paper provides significant insights for digitalization of the energy systems from a global perspective. Some enable, challenges and solutions are also handled to analyze the impact of digitalization.",
                "eval": 0
            },
            {
                "title": "Quantification of Dairy Farm Energy Consumption to Support the Transition to Sustainable Farming",
                "abstract": "As the need for using energy-efficient machinery escalates, energy consumption estimation plays an important role in decision support and planning in the agri-sector. Within the present research study, energy consumption in dairy farms was examined. A deep learning-based load disaggregation approach was used to develop data-driven models to quantify individual energy consumption of milk production-related devices of dairy farms, from a single aggregate measurement. According to the experiments conducted on three dairy farms in Germany, load disaggregation from a single aggregate meter is a viable, cheaper alternative to submetering multiple pieces of equipment to accurately quantify electricity consumption at scale in dairy farms in order to provide the decision support needed to inform measures for tackling climate change.",
                "eval": 1
            }
        ]
    },
    "Query_1": {
        "1-10": [
            {
                "title": "Estimation of Energy Performance Classes of Concrete Structures with Artificial Intelligence Models",
                "abstract": "The construction sector is one of the sectors that make energy efficiency a must. In almost every field related to the construction sector, there is a need for studies in which high performance can be achieved by including artificial intelligence in energy. In this study, energy class models, which are an area of artificial intelligence, which show the efficiency level of energy systems that determine the energy performance of buildings, are examined.",
                "eval": 99
            },
            {
                "title": "Estimation of Energy Demand and Sustainable Source for India & Study of Renewable Energy though Machine Learning",
                "abstract": "In the last decade, the energy industry has shifted its focus toward alternative energy sources such as solar, hydro, and nuclear power in order to satisfy individual needs. There is still an issue with not having enough access to energy in several regions of India. The production of electricity via thermal means, the generation of power through nuclear means, and the generation of power through hydro means are the three principal forms of power generating in India. This paper discusses the power generation from different energy sources and analyses the demand in India between 2017 to 2020 years. The purpose of this research is to examine data and depict it in a manner that may be understood quickly and easily. The purpose of this research is to compile secondary data drawn from reputable sources and examine that data in the context of existing knowledge gaps. Between the years 2017 and 2020, it will be necessary to conduct research and analysis on a variety of alternative energy sources, including thermal power and other thermal sources. Additional machine learning strategies have been used to the solar data in order to study and anticipate. As a result of using this method, the loss and MSE (mean square error) of the solar data time series were discovered. Therefore, the proper use of power is something that might be evaluated and put into practice from an Indian point of view.",
                "eval": 99
            },
            {
                "title": "A Review on the Prediction of Energy Consumption in the Industry Sector Based on Machine Learning Approaches",
                "abstract": "Energy efficiency in industry provides some promising solutions for industrial decarbonization and reduction of negative environ-mental impacts. Nowadays, the digitalization of the industry offers an intelligent industrial work network, which allows the use of learning algorithms for the prediction of energy consumption in order to lower the energy bill. This paper investigates different approaches used to predict energy consumption in industry, including Multiple Linear Regression (MLR), Decision Tree (DT), Artificial Neural Networks (ANN) and Recurrent Neural Networks (RNN) based on data collected of meteorological conditions, energy consumption, and lighting in the industry. The review results indicate that the MLR approach is the best forecasting method.",
                "eval": 99
            },
            {
                "title": "A Comprehensive Study on the Impact of Artificial Intelligence in Autonomous Vehicles",
                "abstract": "Autonomous Vehicles (AV) is one of the prominent research areas in Automobile industry. This autonomous vehicle manufacturing and testing involves several influencing factors that need to be analysed and subsequent decision making is carried out. Added to that the decisions have to be precise and fast. Hence, it is necessary that several activities pertaining to AV leverage the services of Artificial Intelligence (AI) for its functioning. This paper performs a comprehensive study of how Artificial Intelligence and its allied sub domains play a pivotal role in AV operations. The study discusses in detail about the various complex operations in AV for which AI is used to provide solutions. Also, a clear mapping of various sub domains of AI to AV problems is performed. Finally a mapping depicting various complex operations in AV and related AI based solutions in provided.",
                "eval": 99
            },
            {
                "title": "Artificial Intelligence as a Driver of Industrial Competitiveness",
                "abstract": "Beyond our wildest dreams, Artificial Intelligence (AI) is changing industrial growth as well as our mode of living. Numerous nations have started national AI programmes to promote the value and usefulness of AI in smart businesses. However, there are problems with the practical use of AI to address current manufacturing concerns that must be disregarded. Finding various applications that may deliver value and satisfy the rising market but also capital demands is now the largest issue. To provide a concise road map for the methodical development and integration of AI in industrial operations, a systematic framework termed as \"Industrial AI\" was presented along with its key enabling technologies. This paper provides a thorough review of the major enabling solutions for industrial AI throughout the manufacturing sector as a whole and how their systematic implementation will help create new opportunities for value creation and prevent issues from emerging yet.",
                "eval": 99
            },
            {
                "title": "Wind Turbine Power Output Forecasting Using Artificial Intelligence",
                "abstract": "In this paper, wind turbine power output is predicted using Artificial intelligence (AI) techniques. The AI techniques used for predictions are Machine Learning (ML) algorithm and Deep Learning (DL). In ML, polynomial regression is used and Long Short Term Memory(LSTM) was used in DL. This forecasting is long-term forecasting that uses three years of data collected from NIWE (National Institute of Wind Energy) and the results can be used directly for the planning of energy management. Various environmental factors were taken into consideration for forecasting for better accuracy and results. The AI helps to predict the wind turbine output with high accuracy by considering the linear and non-linear types of dataset. This technique can also be used for the preventive maintenance of wind turbines and before the installation of wind power plants in an unfamiliar place to determine the corresponding wind potential.",
                "eval": 99
            },
            {
                "title": "Analyzing Land Use Change and Climate Data to Forecast Energy Demand for a Smart Environment",
                "abstract": "Energy is essential for the sustainable development of nations. Increasing population growth, along with expected increases in duration and intensity of extreme weather, can increase energy demands. There is the potential for further interruption if companies do not appropriately account for an increase in demand, especially with the state and federal agencies implementing a transition to clean energy production by the end of the decade. In order to assess energy demand with changing variables, we conduct energy demand analysis in a moderate emissions scenario in the residential sector that consumes the most energy of all energy sectors. We assess changes in energy demand by comparing results from the data mining / machine learning techniques of Support Vector Machines (SVM) and Artificial Neural Network (ANN). Our results are helpful in contributing to sustainable energy goals in line with smart environment initiatives via greenness and energy efficiency.",
                "eval": 99
            },
            {
                "title": "The Role of Artificial Intelligence in Latin Americas Energy Transition",
                "abstract": "Latin Americas energy transition involves the massive integration of sustainable energy, different than hydro, at large and small scale, consumer empowerment, and the adoption of emerging information and communication technologies (ICT) in the entire electricity sector. These factors boost the usage of Artificial Intelligence (AI) to transform the traditional energy industry into a more complex cyber-physical ecosystem. But unlocking the full AI potential requires understanding working principles, current existing applications, and its comprehensive impact on the energy value chain. This paper discusses the role of AI in this context, emphasizing the key factors for successful implementation in the region and proposing an AI maturity model for the energy transition that allows determining the status and gaps for AI adoption.",
                "eval": 99
            },
            {
                "title": "Feasibility of energy storage systems in different applications for sustainable energy",
                "abstract": "Due to increased population, lot of emissions and pollutions are taking places in power sector, telecommunication sector, automobile sector etc. Hence there is need to reduce Green-house emission and other pollutions in various sectors by reducing/removing our dependency on fossil fuels. Renewable energy sources is gaining lot of attraction in power sector. The power networks faces lot of challenges in transmission and distribution to meet daily demands. In order to meet these challenges energy storage system plays very important role. Energy storage system is playing very important role in automobile industry & telecommunications green technology also to reduce pollution and green-house effect. Lead acid battery is most widely used in India due to its well-known chemistry, infrastructure low price and efficiency. The real disadvantage in lead acid battery is that it easily sulfates because of improper charging and discharging. This sulfation is more dominant in stationary applications. This paper basically focuses on various types of energy storage systems, their viability for particular applications, cost and life. Paper also focuses on the various techniques used to reduce sulfation in lead acid battery application and improving its life by reducing sulfation by artificial intelligence.",
                "eval": 99
            },
            {
                "title": "Artificial Intelligence for Smart Renewable Energy Sector in Europe—Smart Energy Infrastructures for Next Generation Smart Cities",
                "abstract": "One of the most challenging areas of Future Smart Cities Research is the Smart Energy domain. Critical issues related to optimization, provision of smart customizable networks and sophisticated computational techniques and methods enabled by artificial intelligence and machine learning need further investigation. The renewable energy (RE) is a powerful resource for the future global development in the context of climate change and resources depletion. Artificial intelligence (AI) implies new rules of organizing the activities in order to respond to these new requirements. It is necessary to improve the design of the energy infrastructure, the deployment and production of RE in order to face the multiple challenges that will affect the sector’s growth and resilience.. In this research work we exploit the recent developments on the AI adoption for RE sector in European Union (EU). In this respect, we analysed (i) the efficiency of the transformation processes of the RE within the energy chain from Gross Inland Consumption to Final Energy Consumption, (ii) its implications on the structure of renewable energy by source (solar, wind, biomass etc.), (iii) the labour productivity in RE sector compared to the economy as a whole and its correlation with investments level, (iv) the implication of the adoption of AI for RE towards Future Smart Cities Research. The main contribution of this research is the development of a framework for understanding the contribution of AI in the RE sector in Europe. Another bold contribution of this work is the discussion of the implications for Future Smart Cities Research and future research directions.",
                "eval": 99
            }
        ],
        "21-30": [
            {
                "title": "A Federated Learning and Blockchain-Enabled Sustainable Energy Trade at the Edge: A Framework for Industry 4.0",
                "abstract": "Through the digitization of essential functional processes, Industry 4.0 aims to build knowledgeable, networked, and stable value chains. Network trustworthiness is a critical component of network security that is built on positive interactions, guarantees, transparency, and accountability. Blockchain technology has drawn the attention of researchers in various fields of data science as a safe and low-cost platform to track a large number of eventual transactions. Such a technique is adaptable to the renewable energy-trade sector, which suffers from security and trustworthy issues. Having a decentralized energy infrastructure, that is supported by blockchain and artificial intelligence, enables smart and secure microgrid energy trading. The new age of industrial production will be highly versatile in terms of production volume and customization. As such a robust collaboration solution between consumers, businesses, and suppliers must be both secure and sustainable. In this article, we introduce a cooperative and distributed framework that relies on computing, communication, and intelligence capabilities of edge and end devices to enable secure energy trading, remote monitoring, and network trustworthiness. The blockchain and federated learning-enabled solution provide secure energy trading between different critical entities. Such a technique, coupled with 5G and beyond networks, would enable mass surveillance, monitoring, and analysis to occur at the edge. Performance evaluations are conducted to test the effectiveness of the proposed solution in terms of reliability and responsiveness in a vehicular network energy-trade scenario.",
                "eval": 99
            },
            {
                "title": "Energy Efficiency Policy Evaluation Model using Hybrid Evolutionary Programming (EP) - Artificial Neural Network (ANN) for Measurement and Verification Baseline Development",
                "abstract": "This paper presents the development of Energy Efficiency (EE) Policy evaluation model using Hybrid Evolutionary Programming (EP) - Artificial Neural Network (ANN). There are various of EE policies and programmes imposed by governments to promote EE implementation among the industries and societies. However, very little effort was found to evaluate the effectiveness of EE policy for reducing energy consumption. This has created the need for a model that can be used to assess the performance of EE policy and programmes. In this paper, measurement and verification (M&V) approach is proposed for evaluating the performance of Minimum Energy Performance Standards (MEPS) in Malaysia. Artificial Neural Network (ANN) is used for developing a baseline energy model in the M&V framework. Evolutionary Programming (EP) is then integrated with the ANN baseline energy model to improve the performance of ANN. Results show that hybrid EP-ANN provides the highest regression value followed by multi-regression ANOVA model and ANN. With its highest regression value, the EP-ANN provides more accurate and reliable energy savings of 20.03% for the period between 2013 – 2016 from the implementation of MEPS policy in Malaysia.",
                "eval": 99
            },
            {
                "title": "Big Data Management and Analytics in the Era of Artificial Intelligence",
                "abstract": "Big Data (BD) have lately piqued the interest of both academicians and practitioners due to their ability to provide valuable insights for improved decision-making processes. With the goal of creating useful information from huge data, data analytics is fast becoming a popular discipline that many businesses are implementing. Although, the analytics process, such as the implementation and usage of Big Data Analytics (BDA) technologies, has positive influence on the organizational performances, develop new income streams, potentially gain a competitive edge over business rivals, businesses view it as a tool to enhance operating effectiveness. There are several analytic techniques to take into account, though. Given the significance of BD as well as BDA, this article presents a state-of-the-art research that gives a thorough overview of the BD challenges and BDA strategies posited, supported, and employed by businesses to help others better comprehend this environment and make better financial decisions.",
                "eval": 99
            },
            {
                "title": "Tech Mining Analysis: Renewable Energy Forecasting Using Artificial Intelligence Technologies",
                "abstract": "Extracting useable information from large and complex data is one of the challenges that can be solved by data mining. The use of data mining to understand the state of research fields and the underlying technologies which are related in intricate ways is known as bibliometric analysis or \"tech mining\". Tech mining can help in summarizing the important research results that are valuable to researchers, industry, and decision-making. Furthermore, tech mining can be useful in showing the trends and relations of the analyzed topic. Hence, the purpose of this research is to investigate the status and the evolution of scientific studies in the field of renewable energy forecasting using Artificial Intelligence (AI) technologies. The study seeks to address the status of the scientific production indexed in Scopus based on scientometrics indicators. In total, over 25000 articles were extracted. The collected data were analyzed using R software packages. The findings show the exponential growth of this topic in the past 10 years. The most relevant sources, authors, affiliations, and countries were found. Moreover, the most recent trends and technologies were stated. It was also found that the interest in this research topic is prevalent in Asian countries especially China which has the highest number of publications and citations. Moreover, it was found that the most fund for research in this domain comes from Chinese institutions.",
                "eval": 99
            },
            {
                "title": "Application of Transaction Minimization Artificial Intelligent Algorithm for Weblog Analysis",
                "abstract": "Web logs files are analyzed using several kinds of Al and web mining techniques such as web, and data mining in order to extract useful information and utilized them for future purposes. The existing web log files suffer from many drawbacks. An AI-inspired algorithm and cluster-based ranking mechanism have been designed that overcomes the drawback. This paper presents the cluster based ranking mechanism and transaction minimization algorithm in detail in the proposed web log files.",
                "eval": 99
            },
            {
                "title": "Chief Remote Officer Role in COVID-19 for Work Sustainability and Use of Artificial Intelligence (AI)",
                "abstract": "The working environment has evolved after the COVID-19 pandemic from office work to working from home because of changing industry needs with the pandemic effect. Globally, organizations continue to identify the right way to balance employee satisfaction by giving them the hybrid working option, but it lacks standardization. In this research paper, the author discusses the emerging need for the Chief Remote Officer in post-pandemic working conditions. The study also reflects the use of Artificial Intelligence and how it can support human resources in the remote setup. The pandemic virus of 2020 has evolved with several variants, and the continued uncontrollable global situation has arisen. In such unpredictable conditions, the need to bring work sustainability shall be the focus among the organizations for remote working conditions. This study discusses the literature and analyzes the industry's Chief Remote Officer role requirement in detail as people continue to work in the presence of the COVID-19 pandemic. The author elaborates on the Chief Remote Officer and discusses the roles, responsibilities, Knowledge skills, and purpose behind this role. This research paper offers a broader aspect along with Artificial Intelligence usage. Since it is a early stage, the proposed approach would require to be tested by the organizations during the pandemic.",
                "eval": 99
            },
            {
                "title": "AI Based Approach For Path Traversal",
                "abstract": "The manuscript intends to provide holistic overview of AI based forward traversal path and backward traversal path. These path are obtained from a collection of web accesses, once the user session are identified. The proposed work contains an alternative approach to generate path traversal and reduced the forward and backward traversal Path.",
                "eval": 99
            },
            {
                "title": "Artificial intelligence technologies in business and engineering",
                "abstract": "Artificial intelligence (AI) is making its way back into the mainstream of corporate technology, this time at the core of business systems which are providing competitive advantage in all sorts of industries, including electronics, manufacturing, marketing, human resource, financial services software, medicine, entertainment, engineering and communications. Designed to leverage the capabilities of humans rather than replace them, today's AI technology enables an extraordinary array of applications that forge new connections among people, computers, knowledge, and the physical world. Some AI enabled applications are information distribution and retrieval, database mining, product design, manufacturing, inspection, training, user support, surgical planning, resource scheduling, and complex resource management. AI technologies help enterprises reduce latency in making business decisions, minimize fraud and enhance revenue opportunities.",
                "eval": 99
            },
            {
                "title": "A Detailed Investigation on Potential Impact of Quantum Computing on Improving Artificial Intelligence",
                "abstract": "Quantum computing is an emerging technology (QC). Several groups and research institutions are working to make quantum computing applications a reality. Artificial Intelligence (AI) is another emerging field that is becoming more established over time. The main goal of this research is to figure out how the advancement of quantum computing technology will affect AI applications. Computational methods are used to explore the growing influence of quantum computing development for a specific AI application. This study also discusses about the impact and potential of Quantum Computing (QC) on Artificial Intelligence (AI). These can be accomplished by employing cutting-edge methods to deliver usable, economically viable, and scalable technology across a wide range of industries. On the other hand, the risk of committing errors in quantum algorithms, as well as the inability to function without being super-cooled, emerges as a major challenge. Macro-energy systems and the development of sustainable energy materials are just two areas of science and engineering that quantum computing has the potential to completely transform.",
                "eval": 99
            },
            {
                "title": "Utilizing Transportation Infrastructure, Big Data and AI for Localized EV Energy Neutrality",
                "abstract": "The transportation sector in the US consumes 28% of total energy consumption for transporting people and goods. Roughly 92% of transportation is fueled by gasoline, diesel and jet fuel, with electricity providing less than 1% of transportation energy (2018) [1]. The introduction of electric vehicles (EVs) on the road is growing at the rate of 40% Y-o-Y [2], leading to ever increasing demand on grid supplied energy to recharge these EVs. 60% of grid energy is generated from nonrenewable (NR) sources (coal & natural gas). Expending NR sources to service EVs is neither sustainable nor desirable when long term effects are considered. Since EVs are still in their initial stages of mass adoption in the US, an updated and scalable approach to servicing the growing EV energy need is required. One such approach in which existing transport infrastructure (gas stations, roads, trucks etc) are multi-purposed with scalable, feasible modifications is presented in this paper. Furthermore the possibility of optimizing the energy capture-storage-usage (CSU) cycle using big-data and artificial intelligence (AI) is also explored.",
                "eval": 99
            }
        ],
        "51-60": [
            {
                "title": "The Next Generation of eHealth: A Multidisciplinary Survey",
                "abstract": "Over the past two years, the spread of COVID-19 has spurred the use of information and communication technologies (ICT) in aid of healthcare. The need to guarantee continuity to care has promoted research and industry activities aimed at developing solutions for the digitalization of the procedures to be performed to provide health services, even in emergency scenarios. Digital collection, transmission, and processing of health data represent the starting point for fulfilling this innovation process but also bring heterogeneous challenges. These motivations led to the elaboration of this work, which analyzes innovative and technological tools for the development of digital health (eHealth) through the collection of multisectoral literature, produced thanks to the cooperation of varied research groups, thus providing a multidisciplinary survey. Since digital health is expected to be one of the leading applications of the sixth-generation (6G) wireless cellular networks, this paper covers the related telecommunications aspects. Furthermore, the exploitation of artificial intelligence paradigms to elaborate massive amounts of biological data is examined. Given the extreme sensitivity of health data, this paper also investigates security and privacy issues. In particular, the main techniques and approaches to guarantee security properties (i.e., anonymity, responsibility, authentication, confidentiality, integrity, non-repudiation, and revocability) are studied. Applications involving innovative electromagnetic systems for healthcare and assisted living services are described to provide an example of an eHealth scenario leveraging ICT. Finally, the telemedicine-related regulations of the European Commission are analyzed, with particular reference to the General Data Protection Regulation (GDPR).",
                "eval": 99
            },
            {
                "title": "AI Application for the Sustainable Development to Reduce Carbon Footprint",
                "abstract": "The amount of greenhouse gases that are produced by our activities is a carbon footprint. In the United States, the total carbon footprint of a human is 16 tonnes and average electricity consumption is 5300kWh per year which makes a major part of this footprint, The average is closer to 4 tonnes worldwide. The average global carbon footprint per year needs to drop below 2 tonnes by 2050 to have the greatest chance of preventing a 2 ° C spike in global temperatures. Electricity is one of the most efficient and viable option for powering the appliances, cars and even industries with now even cars switching to electric engines it is not going to leave us for a long time unlike the fossil fuels because it can also use renewable sources for its production. Increasing population and more and more use of electricity is creating a need to use it in most efficient manner and it can be done with the help of machine learning and IoT. In this research study it was found that a lot of electricity gets wasted when it's not in use affecting our environment which can be reduced by turning off those appliances and using them smartly by using AI.",
                "eval": 99
            },
            {
                "title": "Applications of Artificial Intelligence in Transportation",
                "abstract": "Artificial Intelligence (AI) is advancing at a breakneck pace presenting unprecedented prospects to improve the performance of various industries and enterprises, including the transportation sector. Transportation planning and operation gives opportunity to meet the demand for safe, cheap, convenient, and sustainable movement of people and products. AI in transportation is urgently needed to handle the challenges of increased travel demand, CO<inf xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</inf> emissions, and traffic safety. Cities around the world are experiencing transportation related issues such as traffic congestion, accidents, and air pollution as a result of population growth. AI in transportation can collect traffic data in order to alleviate traffic congestion and improve public transport scheduling. This paper provides an overview of the use of AI in transportation, with a focus on transportation management, planning and control, intelligent parking monitoring for rapid location, and accident avoidance. The importance of road condition monitoring for increased safety, self-driving cars for increased reliability, and traffic flow analysis for increased efficiency are also discussed. Future trends and challenges of using AI in transportation are also examined.",
                "eval": 99
            },
            {
                "title": "Artificial Intelligence-Based Optimal Allocation of Dynaflow Device",
                "abstract": "Controllers for flexible AC transmission systems (FACTS) have been utilised extensively for the purpose of gaining an understanding of various steady state control issues pertaining to power systems. There are a number of different FACTS controllers that can be used, such as the combined controllers, also known as the Dynaflow Controller. This controller is developed by combing a TCPST and a TSSC and are having coordinated control Power flow is monitored using Dynaflow Controller to avoid overburdening by linking the capabilities of TSSC and TCPST. For the purpose of addressing the OPF problem, PMBC algorithm has been proposed. The idea of using Decision Making to determine the optimal placement of a Dynaflow device has been expanded in order to addresses the problems caused by OPF in a variety of scenarios, including normal conditions, contingency scenarios involving the network, and overloaded scenarios, all while taking into account the aforementioned four goals. The proposed methodology is tested on IEEE 30-bus test system.",
                "eval": 99
            },
            {
                "title": "Application of Extreme Learning Machine in Predicting Short- Term Wind Speed",
                "abstract": "At present, wind energy is the fastest growing power generation sector with its economic advantage of being a rich, clean and environmentally sustainable resources. However, wind does not generally blow consistently which prevents wind turbines from functioning at maximum capacity and capability. However, the solution that had been put forward in this paper to overcome the aforementioned problem is able to be used to make the deterministic predictions study for the wind speed, and of which its model in this paper possesses a significant prediction accuracy and strong stability, which could be useful in predicting the randomness of short term wind speed accurately. Based on the prediction output results, the amount of power required to be generated for load dispatch planning could be calculated and used to produce a scientific basis with the purpose of designing an optimal power grid dispatching design. In this paper, Extreme Learning Machine (ELM) is used for predicting short-term wind speed, and through use of the ELM the prediction accuracy of wind speed was observed to be at 0.93 followed by the root mean square error rate at 1.9. With reference to the prediction results, the developed model is tested to be able to predict wind speed accurately.",
                "eval": 99
            },
            {
                "title": "A Data Science Approach to Modelling a Manufacturing Facility's Electrical Energy Profile from Plant Production Data",
                "abstract": "Sustainable manufacturing is of increasing interest to a large number of batch production facilities. Energy efficiencies achieved through optimized scheduling is a desired target for such facilities. To achieve these energy efficiencies, the initial step is accurately modelling plant energy profiles from historical production schedule data. This poses several challenges as the data required to model plant energy is stored in various sources and does not conform to a common sampling rate or data type. Also, separating the energy consumption caused by plant production from the base load of lighting and HVAC systems is difficult unless each production process is metered adequately. This paper focuses on developing a methodology to deal with the complexities of data collection, data processing and modelling within a pharmaceutical batch production facility. Historical energy and scheduling data have been utilized to generate a model for the site's energy profile. The approach incorporates data science and machine learning tools which pose a possible solution to the problem outlined. The results from this work can feed into an overarching goal of more sustainable manufacturing processes by allowing site energy engineers to predict and better manage plant energy load.",
                "eval": 99
            },
            {
                "title": "Towards Extreme and Sustainable Graph Processing for Urgent Societal Challenges in Europe",
                "abstract": "The Graph-Massivizer project, funded by the Horizon Europe research and innovation program, researches and develops a high-performance, scalable, and sustainable platform for information processing and reasoning based on the massive graph (MG) representation of extreme data. It delivers a toolkit of five open-source software tools and FAIR graph datasets covering the sustainable lifecycle of processing extreme data as MGs. The tools focus on holistic usability (from extreme data ingestion and MG creation), automated intelligence (through analytics and reasoning), performance modelling, and environmental sustainability tradeoffs, supported by credible data-driven evidence across the computing continuum. The automated operation uses the emerging serverless computing paradigm for efficiency and event responsiveness. Thus, it supports experienced and novice stakeholders from a broad group of large and small organisations to capitalise on extreme data through MG programming and processing. Graph-Massivizer validates its innovation on four complementary use cases considering their extreme data properties and coverage of the three sustainability pillars (economy, society, and environment): sustainable green finance, global environment protection foresight, green AI for the sustainable automotive industry, and data centre digital twin for exascale computing. Graph-Massivizer promises 70% more efficient analytics than AliGraph, and 30 % improved energy awareness for extract, transform and load storage operations than Amazon Redshift. Furthermore, it aims to demonstrate a possible two-fold improvement in data centre energy efficiency and over 25 % lower greenhouse gas emissions for basic graph operations.",
                "eval": 99
            },
            {
                "title": "A Survey of Federated Learning From Data Perspective in the Healthcare Domain: Challenges, Methods, and Future Directions",
                "abstract": "Recent advances in deep learning (DL) have shown that data-driven insights can be used in smart healthcare applications to improve the quality of life for patients. DL needs more data and diversity to build a more accurate system. To satisfy these requirements, more data need to be pooled at the centralized server to train the model deeply, but the process of pooling faces privacy and regulatory challenges. To settle them, the concept of sharing model learning rather than sharing data through federated learning (FL) is proposed. FL creates a more reliable system without transferring data to the server, resulting in the right system with stronger security and access rights to data that protect privacy. This research aims to (1) provide a literature review and an in-depth study on the roles of FL in the fields of healthcare; (2) highlight the effectiveness of current challenges facing standardized FL, including statistical data heterogeneity, privacy and security concerns, expensive communications, limited resources, and efficiency; and (3) present lists of open research challenges and recommendations for future FL for the academic and industrial sectors in telemedicine and remote healthcare applications. An extensive review of the literature on FL from a data-centric perspective was conducted. We searched the Science Direct, IEEE Xplore, and PubMed databases for publications published between January 2018 and January 2023. A new crossover matching between the approaches that solve or mitigate all types of skewed data has been proposed to open up opportunities to other researchers. In addition, a list of various applications was organized by learning application task types such as prediction, diagnosis, and classification. We think that this study can serve as a helpful manual for academics and industry professionals, giving them guidance and important directions for future studies.",
                "eval": 99
            },
            {
                "title": "Digital revolution in efficient self-organization of buildings: towards intelligent robotics",
                "abstract": "Artificial intelligence highlights in several sectors, remarkable results of energy efficiency that sublimate the building sector and push it considerably towards new markets, as in small development economies. The objectives are aimed at <i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Digital Construction Management</i> with the adoption of intelligent automation and robotization systems, through eco-production indicators in construction, as a future strategic sector for technological development. For this reason, quality and interoperability in building processes are urged, with a relative reduction in timing and costs, safety, productivity and environmental sustainability. Therefore appeal to parametric design and digital fabrication in <i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Lean Construction</i>, with intelligent robotics and efficient end-effector, ICT technologies, as in the lead countries of which China, Japan, South Korea, Germany and the USA stimulated by the technological boost. The methodologies indicate the application of intelligent systems and devices, learning machines and new generation robotics. They are particularly aimed at office buildings, for efficient self-organization and autonomy in new digital building models, favoring the customized serial production of <i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Mass Customization</i> which stands out in this digital revolution. It becomes the future investment in many countries where there is, above all, a high need for energy demand, compared to the growing demand for C02 and reduction and decarbonization of buildings.",
                "eval": 99
            },
            {
                "title": "How intelligent is the SmartGrid in Ecuador?",
                "abstract": "Electricity is an essential component in modern life and the economy, it has promoted the development of so-called industrial era over an extended period of time, and actual information era; however organisms such as WEC<sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup>, WWAP<sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</sup> and ONU SDG<sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">3</sup> consider the automation of the current power system model as an unsustainable energy system model for the 21st century because renewable energy sources alone will not be sufficient to meet the large increase of the energy demand and fulfill it in 2030. We are in the knowledge era, and it has said that “artificial intelligence is the new electricity” [1]. This sets enormous challenges for implementation of a new model for the infrastructure, the acquisition and use of the smart electricity grid (Smart Grid) in Ecuador where power is required to be affordable, reliable and sustainable. It describes the current situation, and presents the status of implementation of this concept, to then be able to structure the foundations of a model based on artificial intelligence, with participation of each one of its actors, presenting the opportunity to carry the electricity power sector and the Ecuadorian society, a new era of development, sustainability, energy independence, efficiency and high availability.",
                "eval": 99
            }
        ],
        "101-110": [
            {
                "title": "Image Processing Based Security Management System",
                "abstract": "Many industries nowadays struggle with serious security issues, thus hiring security guards is necessary to accomplish security. People make many mistakes as human beings, such as missing targets, and they only have so much energy (they are not able to monitor your environment continuously). These factors may have an impact on the level of security. The methods used worldwide to acquire facial detection and facial recognition also fall under the category of image processing, which is a subset of machine learning and is classified as an aspect of artificial intelligence. In security-sensitive regions, the facial recognition technology may identify a person and lessen the need for men to patrol. A series of photos are taken by the camera sensor as soon as a person enters a highly protected location, and these snapshots are analysed and compared to any previous images in the data set of an authorised individual. The key reason for image processing is that, in the future, this system will handle identification and verification for improved security problem accuracy and transparency. This project is being developed to let authorised users access to restricted locations.",
                "eval": 99
            },
            {
                "title": "The Application of Artificial Intelligence Technology in the Management of Distribution Network Graphics and Models",
                "abstract": "The new generation of artificial intelligence technology represented by big data analysis and deep learning is an important means to lead the industry’s intelligent upgrading and digital transformation. With the advancement and construction of distribution network automation and enterprise middle stations, the distribution network business is showing a development trend of multi-relation and high integration. As a connection object between various business systems, graph model data plays a very important role. This paper proposes a method to manage distribution network graphics and models in the field of power system by using artificial intelligence technologies such as deep machine learning and image recognition. It can intelligently identify and organize the distribution network equipment, connections, text and other elements in CAD(Computer Aided Design) drawings, and automatically generate a structured picture description file of the distribution network wiring diagram, and on this basis, runs through the graphical models import and update process of the distribution network production management system, effectively solving the pain points of the distribution network business, and improving the intelligent level of the distribution network diagram model operation and maintenance.",
                "eval": 99
            },
            {
                "title": "Renewable energy based efficient portable DC refrigerator for rural electrification and convenience - An Overview",
                "abstract": "Rural and remotes places in India, electricity is either unavailable or there is an irregular supply of electricity due to the lack of technological facilities. This leads to one of the main concerns, which is the storage of food materials, medicine, vaccines and other provisions. This might cause a major loss for the people who survive on a daily income basis, such as petty shop owners, pharmacists, farmers, which in-turn, would cause an economic crisis suffer a loss if there is no refrigeration for their condiments. Similarly, pharmacists find it hard to refrigerate medicines in areas where there is an interrupted or irregular supply of power. There are a few products which have to be maintained at a suitable temperature for further usage and to keep them effective. Food and Medical preservation needs sustainable refrigeration and hence help in maintaining the quality of the products. Therefore, using a renewable form of energy that is solar energy for the DC Refrigeration in rural areas will provide sustainable and affordable solution for areas where there is interrupted electrical supply. Therefore, this paper explains how rural electrification can be implemented by the use of a DC Refrigerator at low cost and less maintenance.",
                "eval": 99
            },
            {
                "title": "Speed Regulation of Closed Loop Brush less DC (BLDC) Motor Using Novel Multi-Layer Perceptron Approach",
                "abstract": "Recently developed advanced applications of Brushless DC (BLDC) motor demands for variable speed operation to equate the assessed performance. In this connection, many speed controlling techniques are introduced for the fruitful operation of BLDC motor at various speed levels. The performance of the existing techniques is up to the mark for a fixed speed reference. During dynamic change in reference speed the existing techniques fail to follow the path. Therefore, there is a need to regulate the speed of the BLDC motor during dynamic conditions. Speed regulation is achieved by minimizing the residual error content. If the content of residual error increases, there will be a deviation between actual and reference speed resulting in poor speed regulation. Hence, this paper presents a novel and simple controlling technique based on Multi-Layer Perceptron (MLP) technique, which is capable of regulating the speed as per the dynamic reference path by minimizing the residual error content. MLP is from the compound of deep learning artificial neural network has two layers, one receives speed error data from the traditional PID controller, and the other layer predicts the output data. Computations are performed through Gradient Descent for arbitrary hidden layers to reduce the speed error. As the computed data approaches the target, optimal data for the speed regulation is attained.",
                "eval": 99
            },
            {
                "title": "Sustainable Data Management for Manufacturing",
                "abstract": "The impact of Industry 4.0 will result in more automatic connected assembly lines, which are designed for manufacturing individual and customised products on demand. To enable this capability, the need for information-driven services were introduced, with the ambition that all physical, virtual and human entities shall be able to communicate among each other. This approach will provide much more elaborate production systems with vast amounts of information to transfer. The arising additional data integration challenges have to be solved. This paper motivates the need for the interoperability on the data level, to enable the unified input and output of artificial intelligence (AI) algorithms. Therefore, the approach containing an information model and corresponding translation processes are presented. In doing so, a semantic mediator will be used as a middle layer for gathering all data and provide unified data to AI methods - here, an expert system (ES). Finally, an extracted use case is shown where an ES will optimise the energy efficiency of a running production process by providing the relevant data. By intervening in the actual process, it shows the importance of converting the required input data into one unified format for an AI system.",
                "eval": 99
            },
            {
                "title": "Impact Analysis of wind Energy on Electricity Price using Deep Neural Network",
                "abstract": "The Development scenario for renewable energy across the globe is changing rapidly in terms of capacity addition and grid interconnection. The impact of wind energy on electricity price is significant and it is an important task for power system planners to forecast the price in light of its variability. The impact of wind energy penetration on electricity price using Support Vector Regression (SVR) and Deep Neural Network (DNN) has been investigated for the Austria Electricity market. From the evaluation metrics calculation, it is observed that the DNN model performs better over SVR for the available dataset. The MAPE Value for DNN model was found 5.384 for the available dataset.",
                "eval": 99
            },
            {
                "title": "Coordinated Scheduling for Improving Uncertain Wind Power Adsorption in Electric Vehicles—Wind Integrated Power Systems by Multiobjective Optimization Approach",
                "abstract": "Electric vehicles (EVs) and renewable energy, such as wind power, have been widely utilized to meet the sustainable development of our society. To this end, research articles on the operation performance of the EV-wind integrated power system are important. This article proposes a coordinated scheduling model, which aims to improve the wind power adsorption while considering the energy conservation and emission reduction of thermal generators. Besides, to conduct a comprehensive investigation among these multiple objectives, we formulate the coordinated scheduling model as a multiobjective optimization problem. Then, a multiobjective optimization algorithm based on a parameter adaptive differential evolution is proposed to solve this problem. Simulation results based on a modified Midwestern USA power system verify that the proposed scheduling model could reveal the relationship among multiple objectives, and the integration of EVs can improve the wind power adsorption and cost effectiveness of the power system.",
                "eval": 99
            },
            {
                "title": "Forecasting Solar Irradiance Using Machine Learning",
                "abstract": "Renewable energy is becoming a very popular source for power generation nowadays. In the context of Bangladesh, solar energy has become the most prospective renewable resource for which solar irradiance is a very important parameter. Being able to forecast the solar irradiance accurately can facilitate efficient design of any solar power plant. In this study we have used an Artificial Neural Network (ANN) which is essentially a Machine Learning (ML) approach. As it is time series-based forecasting, we have taken past 15 years' (20002015) daily data from the renewable energy community of NASA database. We have chosen a coastal area for this study case like Saintmartin near Teknaf which has a boundless role in Bangladesh. Here, a feed forward back propagation neural network has been used. Eight important parameters have been considered as independent input variables to forecast daily solar irradiance and the parameters are - air temperature, wind speed, precipitation, humidity, surface pressure, insolation clearness index, and earth skin temperature. The proposed model has provided prediction results with good accuracy and minimal error.",
                "eval": 99
            },
            {
                "title": "A Machine Learning Approach Applied to Energy Prediction in Job Shop Environments",
                "abstract": "Energy efficiency has become a great challenge for manufacturing companies. Although it is possible to improve efficiency applying new and more efficient machines, decision makers tend to look for some less expensive alternatives. In this context, the adoption of more efficient strategies during the production planning can allow the reduction in energy consumption and associated emissions. Furthermore, the current reality of manufacturing companies, brought by Industry 4.0 concepts, requires more flexibility of production systems, thus, increasing complexity for machine rescheduling without compromising sustainable requirements. In this paper, we propose a method to predict total energy consumption in job shop systems applying machine learning techniques. Different schedules may result in different consumption rates. However, there is a nonlinear relationship between these targets. Therefore, an Artificial Neural Network (ANN) is applied for a quick estimation of total energy consumption. In order to validate the model, computational experiments, using digital manufacturing software tools, are performed on different job shop configurations to show the efficiency of the proposed model.",
                "eval": 99
            },
            {
                "title": "Oil palm suitability assessment in the northern region of Sarawak using Geographic Information System and Fuzzy Analytic Hierarchy Process approach",
                "abstract": "Oil palm plantation in Malaysia has been developed on a vast scale due to the tremendous need for crude palm oil. However, the accelerated development of oil palm plantations produced predicaments, such as monoculture cultivation, water quality deterioration, and loss of creatures’ habitats to Malaysia, including Sarawak. The Sarawak government has appointed 2 million hectares of state’s land for oil palm plantation, of which 1.2 million hectares have already been established. However, oil palm suitability assessment is lacking in Sarawak. Hence, it is important to assess oil palm plantation’s suitability in an area with the likelihood of further expanding for oil palm plantation in Sarawak. The suitability assessment is aimed to promote the oil palm industry’s sustainability. The research aims to conduct a land-use suitability assessment in a region with established oil palm plantations around Kabuloh, Miri, the Sarawak’s Northern Region. A Geographic Information System was implemented to evaluate the suitability of oil palm cultivation in the study area. The assessment result showed that 78% of the study area is suitable for oil palm plantations. The developed oil palm suitability map could be utilized as a decision support tool to develop comprehensive planning for future oil palm expansion.",
                "eval": 99
            }
        ]
    },
    "Query_2": {
        "1-10": [
            {
                "title": "Development and Improving Energy Management System in Smart Grid through Integration with Renewable Energy System with AI and Internet of Things",
                "abstract": "An innovative development in the energy substructure is defined as smart grid. The process of maintaining the stability between the supply side and the demand side is denoted as energy management system in smart grid. Further various cutting end solutions are obtained through the internet of things which helps in the overall conversion of conventional power grid into a smart grid network. This leads to rise in the energy internet which is formulated through the interrelationship between electricity producers cum consumers with renewable energy sources. This includes real time implementation with bidirectional flow of power through communication network and considering cost parameter. Thus the various challenges in the electricity production and distribution are done smartly through incorporating artificial intelligence and internet of things.",
                "eval": 99
            },
            {
                "title": "Application of Artificial Intelligence algorithms for Grid integration of Renewable energy sources in the National Grid- Indian Government perspective- A Review",
                "abstract": "According to global energy scenario, unbalance in supply as well demand of energy, emission of greenhouse gases, frequent blackout, researchers from all over the world are now focusing on clean and safe energy sources. In present times, people are more inclined towards renewable sources of energy such as wind and solar energy. More focus is on advanced microgrid technology at the load side. Because of several issues of protection and interconnection of generators, most of the typical traditional power grids are no longer used. In the current years, there has been positive perception about the renewable energy resources into electrical power system is validated by major focus due to its weariless, green energy utilization, its recycling capabilities and storage capabilities, less maintenance. Therefore, it indicated a sign of growing strong economy. Use of artificial intelligence and deep learning knowledge shall help in choosing the source of energy considering the cost of generation. Seasonally cost of generation will vary for different sources of energy. If such data is analysed through cloud storage, it can be processed through selected by different sources shall lead to a super saving. This concept can be applied to larger grids as well as smaller grids in the power network.",
                "eval": 99
            },
            {
                "title": "Estimating the Effect of Renewable Energy Policies on the Republic of Turkey's Gross National Product by using Artificial Intelligence",
                "abstract": "Today, most of the states in the energy field, especially the developed countries in the world, continue to increase the rate of use of renewable energy. The Republic of Turkey is one of these states. This study aimed to examine the effect of the renewable energy transformation process on the gross national product with artificial intelligence in the action plan of the Republic of Turkey in the process of moving away from fossil fuel-based energy sources. We deployed artificial neural networks to estimate Turkey's gross national product. As a result of the study, because of the policy of increasing the use of renewable energy sources by 7% annually and reducing the use of fossil derivative fuels by 8% annually in the next twenty years, the energy distributions in 2043 and their effect on Turkey's gross national product are shown.",
                "eval": 99
            },
            {
                "title": "Tech Mining Analysis: Renewable Energy Forecasting Using Artificial Intelligence Technologies",
                "abstract": "Extracting useable information from large and complex data is one of the challenges that can be solved by data mining. The use of data mining to understand the state of research fields and the underlying technologies which are related in intricate ways is known as bibliometric analysis or \"tech mining\". Tech mining can help in summarizing the important research results that are valuable to researchers, industry, and decision-making. Furthermore, tech mining can be useful in showing the trends and relations of the analyzed topic. Hence, the purpose of this research is to investigate the status and the evolution of scientific studies in the field of renewable energy forecasting using Artificial Intelligence (AI) technologies. The study seeks to address the status of the scientific production indexed in Scopus based on scientometrics indicators. In total, over 25000 articles were extracted. The collected data were analyzed using R software packages. The findings show the exponential growth of this topic in the past 10 years. The most relevant sources, authors, affiliations, and countries were found. Moreover, the most recent trends and technologies were stated. It was also found that the interest in this research topic is prevalent in Asian countries especially China which has the highest number of publications and citations. Moreover, it was found that the most fund for research in this domain comes from Chinese institutions.",
                "eval": 99
            },
            {
                "title": "Investigating the Energy Production through Sustainable Sources by Incorporating Multifarious Machine Learning Methodologies",
                "abstract": "Artificial Intelligence (AI) has the potential to revolutionize the way we predict and manage energy generation from solar and wind sources. It can greatly enhance the accuracy and scalability of energy prediction in solar and wind power systems. The implementation of advanced machine learning techniques can optimize the performance of these renewable energy systems and predict the variability of energy production. AI-powered algorithms can analyze data from various sources such as weather forecasts and historical energy production data to predict energy generation with increased precision, allowing for optimization of the system's operation. Furthermore, AI can also predict energy demand and adjust energy production, accordingly, resulting in reduced energy waste and increased system efficiency. As the demand for renewable energy continues to rise, the integration of AI in this field becomes increasingly crucial in ensuring a sustainable and dependable energy future. In this research, we investigate the utilization of AI techniques for evaluating the generation of hydrogen from solar and wind power. The results of this study will provide insight into the potential of AI tools for forecasting hydrogen production from solar and wind energy. The amount of hydrogen produced from solar energy is up to 93.3 × 10<sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">3</sup>kg/km<sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</sup>whereas estimated production from wind is 6.7 kg/day. The comparison of the performance of the different machine learning models used in the study will help to identify the most effective method for forecasting hydrogen production in this context. Additionally, the study aims to contribute to the growing body of knowledge on the application of AI in the field of renewable energy and its potential to improve the efficiency, scalability, and reliability of energy systems.",
                "eval": 99
            },
            {
                "title": "Sustainability Is Not Enough: Towards AI Supported Regenerative Design",
                "abstract": "Sustainability, to describe it in simpler words, is a process of making things less bad. It is not a long-term solution even if it limits the destruction of the environment to a manageable level. Nevertheless, by just becoming sustainable, one cannot bring back what has been lost. The restoration approach is immediately required to fixing what has been broken by using renewable energy, reforestation and creating biodiversity gains. Redesigning our industrial system of production and consumption around the circular patterns of resource and energy use that we observe in mature ecosystems is a must and a complex endeavour. To create a truly regenerative economy challenges us to work with huge amounts of data. New techniques of data science and artificial intelligence are required in each step of the ecological design. This paper presents some examples of biomimicry in circular design and proposes techniques that integrate data science and artificial intelligence (AI) as tools to accelerate the transition towards the regenerative approach. AI, as an emergent `Fourth Industrial Revolution' technology, can support and accelerate the pace of human innovation to design the future urban developments, to enable innovation in cities. AI has the capability to create a step change, to support an effective economic system that is regenerative by design.",
                "eval": 99
            },
            {
                "title": "Efficient Energy Storage Systems Management in Power Plants with Artificial Intelligence and Price Control",
                "abstract": "The storage systems of energy can contribute a significant part in integration of the renewable energy resources in electrical systems. It is quite important to research methods and techniques that make power projects more profitable. In this paper managing techniques for energy efficiency are discussed along with the comprehensive study of linear programming and swarm optimization techniques. These techniques are also compared with various expert systems and current state-of-the-art E-Broker algorithms and a novel and efficient energy management technique has been purposed along with various results. Finally, this paper presents various analysis for sizing and management to enhancement profit factor of power plants.",
                "eval": 99
            },
            {
                "title": "Application of artificial intelligence in electrical power systems",
                "abstract": "In this paper, the application of heuristic and optimization algorithms based on artificial intelligence (AI) is investigated on electrical power systems. Three distinct areas have been categorized validating the application of AI methods in power systems. It involves classical problem of economic load dispatch in conventional power plant, continuing with optimal sizing issue of renewable energy system in present grid and ending with cyber attacks with mitigation methods on evolving smart grids. The study concludes that the development of intruder detection and prevention systems considering AI techniques will be the new normal having significant impact to counter the cyber attacks on electrical power system.",
                "eval": 99
            },
            {
                "title": "Application of Artificial Intelligence in Renewable Energy",
                "abstract": "Recent shift towards renewable energy resources has increased research for addressing shortcomings of these energy resources. As major issues are related to intermittency and uncertainty of renewable supply, new technologies like artificial intelligence and machine learning offers lot of opportunity to address these issues as they are basically meant for processing of uncertain data. This paper analyses application of machine learning in different areas of renewable energy system like forecasting where machine learning is used to build accurate models, maximum power point tracking where machine learning provides robust and smooth control which is not much susceptible to noise in input, inverter where machine learning can be used to provide high quality power without fluctuation even when input is intermittent. Even though machine learning has many prospects which can be used to address different issues associated with renewable system, whether to employ it as effective solution to problem for given system or not depends on host of factors. This paper analyses all these issues and present a methodical exploration of applications of machine learning, its advantages and challenges in hybrid renewable energy system.",
                "eval": 99
            },
            {
                "title": "AI Legitimacy for Sustainability",
                "abstract": "Sustainability is a vast subject involving various research areas. Emerging technologies, through their development and the possibilities they offer, impact sustainability. In particular, Artificial Intelligence and Machine Learning have been trendy research subjects for almost a decade now. They offer a wide range of potential applications, including energy efficiency and Intelligent Transportation Systems, two key elements for Smart Cities. All these developments seem to put AI in a favorable position to build Sustainability. However, AI’s own ecological impact and carbon footprint is disastrous and drastic changes must be done if this technology is to be used in a sustainable future. This paper offers a short overview of AI potential for sustainability, in the context of Smart cities. Then the drawbacks of AI energy consumption are highlighted. New ways and methodologies are proposed to create greener AI.",
                "eval": 99
            }
        ],
        "21-30": [
            {
                "title": "Advanced warning mechanism to reduce man animal conflict on roads using renewable energy",
                "abstract": "In India alone, animals crossing major highways cause thousands of accidents every day. As more roads are built through forests and through wildlife corridors, the number of encounters between motorists and wildlife is rising. Animals roam these pathways and frequently even cross the street undetected. Animals crossing the road are frequently not noticed by moving vehicles until it is too late to avoid a collision. By informing the drivers of the vehicles that there are animals on the road from a distance, these accidents can be significantly decreased. The goal was to create a self-contained, renewable energy gadget that can identify animals that are crossing roads and warn drivers of approaching automobiles at a distance using a display or buzzer.",
                "eval": 99
            },
            {
                "title": "Intelligent Energy Management for a Building DC Nanogrid",
                "abstract": "Nowadays, the world is subject to the development of science and technology, transforming all the old systems into new and more efficient ones, and power grids are the perfect example of this development. Conventional power grids are a source of frequent problems, including line losses that cause instability in the distribution of electricity and a huge impact on the environment, causing damage related to climate change. Addressing these problems is seen as an action to achieve sustainable development goals, to ensure a better future. Energy plays a role in improving these goals, which makes automation a very important tool for establishing a more intelligent and reliable distribution. Among these solutions are DC nanogrids, which have the ability to generate energy using their own renewable resources, even in remote areas thanks to artificial intelligence. They can be automatically regulated to prevent energy shortages. This work aims to intelligently manage the distribution of energy produced by several renewable sources in a DC nanogrid. To solve this problem and to ensure a good energy management we have opted to use Fuzzy logic method as artificial intelligence element that controls the energy management in the nanogrid. The simulation results obtained from the proposed algorithm show that it is able to effectively manage the balance between the renewable energy power produced by the nanogrid without causing power imbalance or disruption of the overall system.",
                "eval": 99
            },
            {
                "title": "Estimation of Energy Demand and Sustainable Source for India & Study of Renewable Energy though Machine Learning",
                "abstract": "In the last decade, the energy industry has shifted its focus toward alternative energy sources such as solar, hydro, and nuclear power in order to satisfy individual needs. There is still an issue with not having enough access to energy in several regions of India. The production of electricity via thermal means, the generation of power through nuclear means, and the generation of power through hydro means are the three principal forms of power generating in India. This paper discusses the power generation from different energy sources and analyses the demand in India between 2017 to 2020 years. The purpose of this research is to examine data and depict it in a manner that may be understood quickly and easily. The purpose of this research is to compile secondary data drawn from reputable sources and examine that data in the context of existing knowledge gaps. Between the years 2017 and 2020, it will be necessary to conduct research and analysis on a variety of alternative energy sources, including thermal power and other thermal sources. Additional machine learning strategies have been used to the solar data in order to study and anticipate. As a result of using this method, the loss and MSE (mean square error) of the solar data time series were discovered. Therefore, the proper use of power is something that might be evaluated and put into practice from an Indian point of view.",
                "eval": 99
            },
            {
                "title": "ICT based Smart Management Solution to Realize Water and Energy Savings through Energy Efficiency Measures in Water Distribution Systems",
                "abstract": "The water companies should provide services at the affordable tariffs for all people, irrespective of the water source, geographical area, size or complexity of water supply system. In order to contribute to the sustainability of water distribution infrastructure, tariffs should cover, in practice, at least the operating and maintenance costs. To obtain a lower water tariff, the water-energy nexus should be take into account. Thus, developing the innovative technological solutions which to allow new water pricing options and policy actions based on energy efficiency measures and Information and Communication Technologies (ICT) to implement the EU water policy represent a new research direction. The paper proposes an innovative solution represented by a software platform for a sustainable management of water supply systems which to include the advanced ICT solutions (Blockchain and Artificial Intelligence) and smart concepts (smart metering, demand response) with benefits both energy and water fields. The platform could lead to realize significant energy and savings through technical measures and a smart management, supplying the consumers with quality water at an affordable tariff considering the socio-economic factors.",
                "eval": 99
            },
            {
                "title": "Data analytics to increase efficiency of the AI based energy consumption predictor",
                "abstract": "These days most of the developed countries have been focusing on energy consumption forecasting. The smart management of energy became the key note for many researchers in aspects of better understanding of the complex pattern of energy production, distribution and utility line. The AI based smart predictor mainly depends on the huge historical data analytics along with a set of modelling algorithms to specify each logical part. In this paper we have discussed about the core data analytics and the manual evaluation to capture the exact patterns from a real time versatile building energy consumption dataset which could be utilized in the implementation of an AI based smart predictor. With high dimensional data visualization and data analytics we were able to attain relatively lower mean absolute error i.e. a reduction of error up to 40.22% in the data pre-processing phase. We have mainly focused on the handling of the real time energy consumption data set and to trace out the energy supply or consumption breakdown conditions. From a publicly available data set, various data pre-processing criteria have taken and prepared the data-frame for the multivariate prediction model. After data pre-processing linear regression has been used to predict the energy consumption per carpet area and the prediction efficiency has been compared for each cases. With the manual evaluation and the tracing of energy breakdown or any other unusual condition, the prediction performance increased up to 31.03%.",
                "eval": 99
            },
            {
                "title": "Research on improving requirement of renewable energy forecasting for system anti-disturbance",
                "abstract": "Due to the integration of renewable energy, the maximum output of conventional power plants is reduced, and the change of peak valley difference is no longer periodic. In order to cope with the fluctuation of renewable energy, the system needs to increase the rotating reserve capacity. At present, power supply is mainly thermal power in China. The inflexibility of thermal power switch and the existence of minimum technical output increase the volatility of start-up response to renewable energy, and limit the output of renewable energy in the period of low load and renewable energy. Predicting the output power of renewable energy and reducing the uncertainty of renewable energy fluctuation is one of the effective means to reduce the redundant standby capacity of the system. The increase of reserve capacity is related to the prediction accuracy of output power of renewable energy stations. Therefore, renewable energy power prediction is of great significance to the safe and economic operation of power system. According to the requirements of relevant documents and regulations of the national energy administration, all grid connected renewable energy stations need to establish a renewable energy power prediction system. In this paper, hundreds of renewable energy power forecasting service providers has emerged. However, the performance and prediction accuracy of renewable energy power prediction results are uneven, there is a lack of unified test standards and test platform, and an effective integration mechanism and identification method have not been established. Therefore, it is necessary to establish relevant evaluation mechanisms and provide third-party evaluation services, so as to provide a fair reference for selecting strong renewable energy production scheduling support services. However, different from conventional power supply, renewable energy has random volatility, and large-scale renewable energy grid connection brings challenges to the security, stability and economic operation of power grid.",
                "eval": 99
            },
            {
                "title": "The Need for Artificial Intelligence for Energy-Efficiency Management: A Review",
                "abstract": "The research presented in this paper examines the potential of artificial intelligence (AI) to improve energy-efficiency management in South Africa. This paper reviews and compares conventional methods with AI-based techniques used in energy-efficiency management systems. Various AI techniques have been investigated in this domain such as the artificial neural network and support vector machine. AI techniques offer the advantage of being more accurate when calculating non-linear parameters and thus are more efficient. Improved energy efficiency could allow more communities to gain access to electricity and improve their general living conditions.",
                "eval": 99
            },
            {
                "title": "Possible Contributions of Smart Grids to Regional Development of Countries",
                "abstract": "Although smart grid concept has recently become a subject of academic studies; impacts of this concept appear in many areas of engineering. Today, the smart grid concept involves many subjects from the efficient use of electrical energy resources to the planned and programmed consumption of energy, from the integration of distributed renewable energy sources into the system to the domestic productive consumers (prosumers), which are much related to local or regional development. Smart grid concept, which emerges a product of interdisciplinary studies ranging to many fields of engineering such as power systems, control, artificial intelligence and communication, can be briefly viewed as a development process towards the internet of energy. Especially in recent years, the decrease in reserves of fossil-fueled energy sources has led researchers to find out new energy sources, more efficient and ecological production and distribution methods. In these studies, the energy sources, which are renewable, sustainable, and economical have become major priorities due to reducing carbon emissions. However, the scope of smart grid studies has been continuously enriched and it has begun to include the fundamental components of production-centered sustainable development models, which are the providing of low-cost production supplies, continuity of these supplies, efficiency in production and consumption, generation based on renewable or recyclable resources, and applications of ecological generation and consumption methods. In this context, the positive effects of smart grids on the regional development are expected to occur in the following topics: Smart city applications, intelligent transportation, renewable and local energy generation, smart homes and building concepts, energy efficient cities, control of carbon footprint, automated electricity, gas, water and waste networks, loss and leakage control, application of demand side energy management system to reduce power consumption, self-healing electricity distribution, smart energy pricing, smart energy storage are some emergent topics that can contribute to sustainable regional development models. Because, modern grid components developed within the scope of smart grid are expected to support sustainable production models via smart energy management and increasing efficiency, reducing the energy costs, improving energy continuity. In this study, a projection for possible contributions of smart grid concept with its continuously expanding scope to the sustainable regional development is discussed under several major headings.",
                "eval": 99
            },
            {
                "title": "Keynote 2 - Computational Sustainability: Computing for a Better World and a Sustainable Future",
                "abstract": "Summary form only given, as follows. The complete presentation was not made available for publication as part of the conference proceedings. Artificial Intelligence (AI) is a rapidly advancing field. Novel machine learning methods combined with reasoning and search techniques have led us to reach new milestones: from computer vision, machine translation, and Go and Chess world-champion level play using pure self-training strategies, to self-driving cars. These ever-expanding AI capabilities open up new exciting avenues for advances in new domains. I will discuss our AI research for advancing scientific discovery for a sustainable future. In particular, I will talk about our research in a new interdisciplinary field, Computational Sustainability, which has the overarching goal of developing computational models and methods to help manage the balance between environmental, economic, and societal needs for a sustainable future. I will provide examples of computational sustainability problems, ranging from biodiversity and wildlife conservation, to multi-criteria strategic planning of hydropower dams in the Amazon basin and materials discovery for renewable energy materials. I will also highlight cross-cutting computational themes and challenges for AI at the intersection of constraint reasoning, optimization, machine learning, multi-agent reasoning, citizen science, and crowd-sourcing.",
                "eval": 99
            },
            {
                "title": "Robust Optimal Virtual Inertia Control for Microgrid Frequency Regulation Considering High Renewable Energy Penetration",
                "abstract": "The rapid increase in penetration of wind and solar power into power systems reduces the rotational inertia of the systems. The low inertia results in high-frequency perturbation and rate of change of frequency (RoCoF), which could lead to frequency instability during contingencies. This problem can be tackled by developing virtual inertia (VI) control scheme in the microgrid (MG). The VI control injects active power via an energy storage system (ESS) to the MG during periods of frequency deviations. In this way, the VI control imitates the inertia characteristic and adds to the total inertia of the MG. Therefore, this paper proposes a robust linear quadratic integral regulator (LQRI) to regulate the frequency deviation and enhance the MG frequency stability. The control problem is formulated in terms of linear matrix inequalities (LMI) in the discrete-time domain. The optimal controller gains are obtained by solving the LMI using convex optimization. The correctness and efficiency of the proposed scheme are demonstrated via discrete time-domain simulation under varying renewable energy sources and loads. The results show that the proposed controller can suppress the frequency deviation at a very fast rate. Finally, a comparative examination of the proposed scheme with an existing VI controller is provided to highlight the improvement in the frequency response of the MG under contingencies.",
                "eval": 99
            }
        ],
        "51-60": [
            {
                "title": "IntelligEnsia for Energy Sustainability Case Study: Manado, Indonesia",
                "abstract": "Energy sustainability is one of the world focuses and a crucial matter today. In this information technology era, many fancy technologies have been designed and created to help human in creating the better living. In fact, they are also the main causes why the energy demand is increasing. This research is trying to introduce IntelligEnSia, as the recommendation in order to achieve the energy sustainability that focuses in Manado, Indonesia. We realize that the research in this field has been flourished, thus we want to introduce the competences of IntelligEnSia which are relied on the Business Intelligence and its potential to create the new effective behavior. It can provide intelligence reporting of the energy consumption for the better and effective energy management system in the city: resources, availability, consumption and characteristics peak load to peak off times. It is included the report of the list that have improved their consumption behavior. Finally, our solution may help government and industries in decision making and creating policies regarding energy management and the goal to achieve the new better behavior for the energy sustainability.",
                "eval": 99
            },
            {
                "title": "System for monitoring and controlling renewable energy sources",
                "abstract": "This article shows the possibility of using renewable energy sources in order to improve energy efficiency, reduce greenhouse gas emissions and therefore prevent climate change. This article proposes a remote monitoring and control system with interfaces and data collectors. In addition to research, development, testing and use of renewable energies, it is also necessary to measure and track online, from a distance all the phenomena that occur. Due to the evolution of information and communications technologies, monitoring and control techniques, they need to be tested in practice before marketing. This ensures both scalability and interoperability, demonstrating the possibility of collecting, centralizing, analyzing energy consumption and CO<inf xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</inf> data. In this way, measurable character, data transparency, company acceptability, planning and visibility of renewable energy usage can be improved. And of course, its impact on the environment must be monitored.",
                "eval": 99
            },
            {
                "title": "Assessment research on accommodation capacity of renewable energy in distribution network",
                "abstract": "On the basis of encouraging and promoting the development of distributed generation, the state has also issued relevant policies to regulate its integration. There is an urgent need to promote the construction of distributed renewable energy power stations on the premise of safe and stable operation of power grid. Guided by the consumption of renewable energy, guide the optimization of layout and orderly integration. The existing research results in the world are mainly divided into two categories: dynamic simulation method and mathematical optimization method. Neither of the above two methods has the actual computing power of the whole network distributed renewable energy accommodation capacity. The accommodation capacity of distributed renewable energy connected to the power grid is restricted not only by the security of distribution network, but also by the overall consumption capacity of renewable energy main network. If the renewable energy absorption capacity of the main network is not considered, the grid connection of distributed renewable energy beyond the penetration limit would inevitably lead to insufficient peak shaving capacity or transmission congestion of the main network, further aggravating the phenomenon of centralized renewable energy. In addition, the calculation of the renewable energy consumption capacity of the main network has not taken into account the power flow constraints of the transmission lines in the province and the safety boundary of the distribution network. Therefore, the calculation results of the consumption capacity on the accommodation capacity cannot be obtained by dimensionality reduction. Therefore, only by comprehensively considering the factors such as distribution network security constraints, main network absorption capacity and main network power flow constraints, can the accommodation capacity of distributed renewable energy be scientifically and reasonably evaluated.",
                "eval": 99
            },
            {
                "title": "The Impact of Low Electricity Prices on Renewable Energy Production",
                "abstract": "Many countries are actively developing plans to increase renewable energy production with some countries even targeting a goal of 100% renewable energy within the next few years. The reasons are twofold, reduced carbon emissions and reduced dependence on fossil fuels with the associated fluctuations in oil and natural gas prices. However, several other countries have not been taking the required actions to increase their production of renewable energy. In some cases, this occurs in energy-rich countries where electricity prices are heavily subsidized and hence residential and commercial consumers have no incentive to invest in renewable energy because the time taken to offset the investment is far too long. We use Machine Learning techniques to quantify this conjecture by showing the relationship between renewable energy production and electric prices for various countries. The data used for this exercise (namely electricity costs and renewable energy production per country) is taken from various online datasets. We conclude that, in order for a country to seriously increase its renewable energy production so that it is a significant percentage of total energy production, it must first reduce the heavy subsidies provided to its citizens. Using our model, we can determine, for a given country, what reduction in subsidies is required to achieve a certain renewable energy production target. Countries can then use this information to plan future renewable energy targets and electricity subsidy reductions. We use our home country as a use case for this exercise.",
                "eval": 99
            },
            {
                "title": "Study on Online Recognition Method of Renewable Energy Cascading Tripping Evaluation Based on Machine Learning",
                "abstract": "Considering that there are many factors affecting renewable energy cascading tripping, it is difficult to assess renewable energy tripping risk quickly and accurately. Machine learning has been extensively studied in power system security and stability evaluation. Machine learning can ensure both accuracy and rapidity of renewable energy cascading tripping identification. A method of cascading tripping evaluation based on support vector machine considering conservative principle is proposed. The method combines causal analysis and statistical theory to extract key characteristic quantities. The mapping relationship between system characteristic quantities and renewable energy tripping is established by training to identify cascading renewable energy tripping under contingency and update the prediction model rolling with simulation results to avoid the occurrence of misjudgment. The validity and practicality of the proposed method is verified by an example of actual power system.",
                "eval": 99
            },
            {
                "title": "Robotics and Artificial Intelligence in Hospitality Sector: A Descriptive Bibliometric Analysis and Future Research Directions",
                "abstract": "In the mid-twentieth century, the idea of artificial intelligence (AI) and robots was first explored. Since then, AI has driven the interests of researchers in every sector worldwide. Automated distribution, conveyor restaurants, chat bots, mechanical concierges, and other innovations in the hospitality business are all instances of how the industry has begun to integrate artificial intelligence and robots. Despite the enormous advances in science and technology, the hotel / hospitality business has a limited amount of robotics and AI research. Using a bibliographic approach, this study analyzes research on AI technologies and robotics in the hotel trade. VOSViewer, a bibliographic mapping tool, is used to extract the information from Scopus. Authorship, citations, publication volumes, organizational origins, and other indicators are studied via the VOSViewer tool.",
                "eval": 99
            },
            {
                "title": "AI Driven Approach for Detecting False Data Injection Attacks Targeting Water-Energy Nexus",
                "abstract": "As water and energy grids are highly interconnected, water-energy nexus (WEN) is considered an attractive target for malicious attackers. Attacking WEN affects both systems simultaneously; consequently, the attack is able to create fatal damage in the entire network. In this paper, we propose to tackle this problem using different deep learning models with different loss functions. Additionally, a mixed-integer nonlinear programming (MINLP) WEN in presence of renewable energy sources model is reformulated into a mixed-integer linear programming model for real-time implementation purposes. The optimization model is developed using MATALB, and the deep-learning models are implemented using Python keras framework.",
                "eval": 99
            },
            {
                "title": "A Comparison of Machine Learning Methods for Frequency Nadir Estimation in Power Systems",
                "abstract": "An increasing penetration level of inverter-based renewable energy resources changes the inertia of power systems, posing challenges for maintaining the desired system frequency stability. An accurate frequency nadir estimation is crucial for power system operators to prepare preventive actions against large frequency excursions. In this paper, five machine learning methods—linear regression, gradient boosting, support vector regression, an artificial neural network, and XGBoost—are applied to two different datasets, i.e., 1) the unit generation dataset and 2) the system total inertia and headroom dataset, for the prediction of the frequency nadir. The training and testing datasets are generated through extensive generation scheduling simulations using Multi-timescale Integrated Dynamic and Scheduling (MI-DAS) toolbox on the Western Electricity Coordinating Council 240-bus system with high renewable penetration levels. Numerical results show that all five machine learning methods perform well in predicting the nadir frequency of the system. Among them, the gradient boosting and the XGBoost are clear winners yielding the best prediction accuracy in terms of four evaluation metrics.",
                "eval": 99
            },
            {
                "title": "Research on Modeling System of Stochastic Gas Integrated Energy Dispatch Based on Computer Artificial Intelligence Technology",
                "abstract": "This paper proposes a two-layer optimal dispatching model of the power-natural gas integrated energy system, considering the rational utilization of photovoltaics and the optimal operation of the natural gas system. A thermoelectric coupling RIES optimal dispatch model with electricity to gas is constructed to minimize the sum of the system energy purchase cost, operation and maintenance cost, and energy loss cost. In the integrated energy system with P2G, this paper adopts a robust optimization engineering game model on the source side to deal with the photovoltaic uncertainty given the relatively large forecast error of renewable energy and relatively high load forecast accuracy. At the same time, the stochastic optimization method is used on the load side to deal with the load uncertainty, and a robust stochastic optimal scheduling model of the integrated energy system considering the refined model of power to gas is constructed.",
                "eval": 99
            },
            {
                "title": "Research on the Evaluation Framework of Renewable Energy Accommodation in Electricity Market",
                "abstract": "With the development of renewable energy, a significant impact on the economy, safety, and low-carbon indicators of the power system has occurred. In addition, the construction of the electricity market is gradually maturing. As a result, it triggered us to look into the renewable energy consumption of the power system in the electricity market. In this paper, an evaluation framework of renewable energy consumption in the electricity market is proposed. Firstly, an evaluation framework of renewable energy consumption based on system operation, social-economic benefits and social-environmental benefits has been built. After that, several secondary indicators based on each primary indicator has been set. Secondly, the min-max normalization method is used to make the dimensional indicators dimensionless. Then the entropy weight method is used to determine the indicators. We apply the evaluation framework of renewable energy consumption to different power market rules to compare the new energy consumption capacity. These evaluation indicators can guide renewable energy investment enterprises, power grid dispatching organizations, and renewable energy generation enterprises to make more reasonable decisions to promote the consumption of renewable energy in the electricity market. Finally, the electricity market in Jiangsu is employed to verify the effectiveness and feasibility of the method proposed in this paper.",
                "eval": 99
            }
        ],
        "101-110": [
            {
                "title": "Design of an Energy Management System with Power Fluctuation Mitigation Capability for PV/Wind Hybrid Renewable Energy Sources",
                "abstract": "Wind speed and solar radiation in renewable energy sources are natural variables. For this reason, the balance between energy production and demand cannot be maintained continuously and Battery Energy Storage Systems (BESSs) and energy management units are used in these systems. In this study, a BESS control system is proposed. The proposed BESS control system is designed to eliminate the negative effects of power fluctuations that may arise due to rapid changes in natural factors such as wind speed and solar irradiation, as well as back-up energy storage, and thus both the load and grid power quality is improved. The hybrid system with wind turbine and solar photovoltaic (PV) modules and the proposed control scheme are modeled in MATLAB/Simulink and tested. The simulation results validate the performance of the proposed BESS control system on decreasing the power fluctuations.",
                "eval": 99
            },
            {
                "title": "AI Application for the Sustainable Development to Reduce Carbon Footprint",
                "abstract": "The amount of greenhouse gases that are produced by our activities is a carbon footprint. In the United States, the total carbon footprint of a human is 16 tonnes and average electricity consumption is 5300kWh per year which makes a major part of this footprint, The average is closer to 4 tonnes worldwide. The average global carbon footprint per year needs to drop below 2 tonnes by 2050 to have the greatest chance of preventing a 2 ° C spike in global temperatures. Electricity is one of the most efficient and viable option for powering the appliances, cars and even industries with now even cars switching to electric engines it is not going to leave us for a long time unlike the fossil fuels because it can also use renewable sources for its production. Increasing population and more and more use of electricity is creating a need to use it in most efficient manner and it can be done with the help of machine learning and IoT. In this research study it was found that a lot of electricity gets wasted when it's not in use affecting our environment which can be reduced by turning off those appliances and using them smartly by using AI.",
                "eval": 99
            },
            {
                "title": "Multiagent Reinforcement Learning for Community Energy Management to Mitigate Peak Rebounds Under Renewable Energy Uncertainty",
                "abstract": "Price-based demand response (DR) can aid power grid management, but an uncoordinated response may lead to peak rebounds during low-price periods. This article proposes a community energy management system based on multiagent reinforcement learning. The scheme consists of a community aggregator that optimizes the total community electricity cost for multiple residential users. A home requires energy management for home appliances, electric vehicles, energy storage systems, and renewable energy generation. The appliance scheduling problem is decomposed into smaller sequential decision problems that are easier to solve. Renewable generation is predicted and used to mitigate the influence of energy generation uncertainty. As indicated in numerical analyses, the proposed approach can handle the uncertainty in renewable energy and leads to more economical energy usage relative to existing energy management methods. The method outperforms conventional algorithms, such as centralized mixed-integer nonlinear programming and genetic algorithm-based optimization, in terms of mitigating peak rebounds and addressing the uncertainty of renewable energy generation.",
                "eval": 99
            },
            {
                "title": "The Role of Artificial Intelligence in Latin Americas Energy Transition",
                "abstract": "Latin Americas energy transition involves the massive integration of sustainable energy, different than hydro, at large and small scale, consumer empowerment, and the adoption of emerging information and communication technologies (ICT) in the entire electricity sector. These factors boost the usage of Artificial Intelligence (AI) to transform the traditional energy industry into a more complex cyber-physical ecosystem. But unlocking the full AI potential requires understanding working principles, current existing applications, and its comprehensive impact on the energy value chain. This paper discusses the role of AI in this context, emphasizing the key factors for successful implementation in the region and proposing an AI maturity model for the energy transition that allows determining the status and gaps for AI adoption.",
                "eval": 99
            },
            {
                "title": "Novel AI Based Energy Management System for Smart Grid With RES Integration",
                "abstract": "The different energy assets such as solar panels and batteries help electrical engineers to manage and meet the increasing demand. The amalgamation of renewable energy resources with artificial intelligence is the key focus of providing high energy efficiency with alternative sources. This solution will not only meet electricity demand but also help in reducing greenhouse gas emissions as a result the efficient, sustainable and eco-friendly solution can be achieved which would contribute a lot to the smart grid environment. Here, a modified grey wolf optimizer approach is utilized to develop a novel energy management system for SPV-based microgrid considering modern power grid interactions. The proposed approach aims to provide a proficient microgrid that utilizes solar photovoltaic technology, and energy storage systems using an artificial intelligence algorithm-based microgrid control for optimal dispatch of energy in grid-connected systems. The performance of this novel energy management system is validated under sunny day and cloudy day, to emulate the stochastic nature of solar photovoltaic systems. A comparative study with mixed linear programming is also conducted that indicates towards the savings in 23.34% and 45.55% of the rolling cost for a clear and cloudy day respectively.",
                "eval": 99
            },
            {
                "title": "An Efficient Artificial Intelligence Energy Management System for Urban Building Integrating Photovoltaic and Storage",
                "abstract": "The emerging leading role of green energy in our society pushes the investigation of new economic and technological solutions. Green energies and smart communities increase efficiency with the use of digital solutions for the benefits of inhabitants and companies. The paper focuses on the development of a methodology for the energy management, combining photovoltaics and storage systems, considering as the main case study a multi-story building characterized by a high density of households, used to generate data which allow feasibility foresights. The physical model of the algorithm is composed by two main elements: the photovoltaics modules and the battery energy storage system. In addition, to gain information about the real-time consumption a machine learning module is included in our approach to generate predictions about the near future demand. The benefits provided by the method are evaluated with an economic analysis, which computes the return of the investment using the real consumptions of a Boarding School, located in Turin (Italy). The case study analyzed in this article showed an increase in purchased energy at the minimum price from 25% to 91% and a 55% reduction in the electricity bill compared to most solutions on the market, with no additional costs and a stabilizing effect on the grid. Finally, the economic analysis shows that the proposed method is a profitable investment, with a breakeven point of thirteen years, due to the very simple implementation and the zero additional cost requested.",
                "eval": 99
            },
            {
                "title": "Reviews: The Impacts of Electric Vehicles (EVs) and Renewable Energy Resources (REs) on The Distribution Power Network",
                "abstract": "The conventional Medium voltage (MV) and Low Voltage (LV) distribution power network had the power flow in one direction, which flows from the power plant (calls central generating) downward to the consumer. However, this power flow direction is starting to change, and hence it is becoming the Bi-directional. Because the accommodating of Renewable Energy resources (REs) such as wind turbine, Photovoltaic (PV) and Electric Vehicles (EVs) etc. In addition, the uses of power electronic devices such as converter (stabilises the use of voltage), inverter (inverses between AC-DC or DC-AC) and charger (supports EVs) are also dramatically increasing, and thus it is also effected the Power Quality (PQ) on the distribution network as same as the power flow. According to the impacts of the REs and EVs, the distribution network must face the challenge. The demand of electricity such as the consumers' behavior, types of REs, charging/un-charging EVs is necessary to investigate. This investigation will be more complicated as the variations in demand profiles. These large data in the network can be called the `Big data' of the power network. The `Big data' can increase the development in the monitoring and controlling systems of the network, and hence it is allowed the network to become smart network. The distribution network must have the ability and capability to accommodate the REs and EVs. Therefore, the standards and regulations of REs and EVs connection, standards and regulations of Feed-In-Tariffs (FIT), the revision of Power Purchase Agreement (PPA) between provider and consumer, smart meters, smart On-Load Tap Changer Transformer (OLTC), smart EVs Car Park, Smart Energy Storage, smart Artificial Intelligent (AI) to manage Big Data, etc. are necessary required to study.",
                "eval": 99
            },
            {
                "title": "Supply Chain Energy Sustainability with Artificial Intelligence",
                "abstract": "Supply chain (SC) processes are complex and have been the subject of many optimization studies. The optimization of the SC is pivotal for the success of a business. optimizing SC usually requires rapid responses and additional resources, resulting in increased energy demand that in turn yields augmented CO<inf xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</inf> emission. The advent of the Artificial Intelligence (AI) has delivered alternative optimization opportunities when adopted as a digital tool. This research provides insights into AI application for optimizing SC processes in order to decrease energy demand and CO<inf xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</inf> emission. The AI engine is based on a Cyber Physical System (CPS) developed using business activities as defined by business processes. A Monte Carlo simulation is adopted to ensure that the baseline (CPS) model is statistically representative. The probability functions and results of2400 runs are extracted and inputted into Python code to generate ordinary least square (OLS) multiple linear regression model. The results of the OLS are used to create energy optimization formula to reduce CO<inf xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</inf> emission and yield sustainable energy in the SC.",
                "eval": 99
            },
            {
                "title": "The use of machine learning (ML) in sustainable systems-An Overview",
                "abstract": "Machine learning has the ability to dramatically improve sustainable systems by anticipating needs, maximizing resource use, raising output, and lowering waste. An overview of earlier studies on the incorporation of machine learning into sustainable systems is presented together with a case study of how machine learning was used to lower energy use in a residential structure. The results show that machine learning may be used to increase energy efficiency and save a lot of money. Wearable technology has added a whole new dimension to the already vast field of personal electronics. The mobile phone gave devices their true individuality. Because so many services are designed around mobile phones, the market has opened up for a brand-new personalized experience utilizing wearable technologies. Fabric sensors may now be combined with wearable microcontrollers like the flora and lily pad to monitor stretch, pressure, bend, and even the direction that the body is being braced. The connections between them are based on conductive threads that follow the curve of the fabric. We'll examine how different teams used their in-depth understanding of wearable technologies to accomplish their goals in this study.",
                "eval": 99
            },
            {
                "title": "Improving the Frequency Response of High Renewable Penetrated Islanded Microgrids",
                "abstract": "The integration of renewable energy sources (RESs) into microgrid weakens the inertia of the microgrid and negatively affects its frequency stability. Recently, this problem is rectified using the derivative virtual inertia (VI) control strategy in the form of an energy storage system (ESS) to improve the inertia and frequency stability of the microgrid. The derivative VI controller calculates the rate of change of the frequency deviation (RoCoF) for injecting active power into the microgrid during periods of contingencies. However, the main problem of the derivative VI controller is that the damping effect is neglected in its design. As such, it might give an unsatisfactory performance in a microgrid with low damping. Therefore, this paper proposes an improved derivative VI controller that can emulate both inertia and damping concurrently. A differential evolution (DE) algorithm has been utilized to optimize the virtual inertia and damping coefficients. The performance of the proposed VI controller is validated through simulation studies under different RESs and loads. Moreover, performance comparison between the proposed VI controller and the existing VI control techniques shows that the frequency response is more robust and accurate under the action of the proposed VI controller.",
                "eval": 99
            }
        ]
    },
    "Query_3": {
        "1-10": [
            {
                "title": "From Conventional to Sustainable SHM: Implementation of Artificial Intelligence in The Department of Civil Engineering, University of Malaya",
                "abstract": "Computer-based technologies and their applications pervade everywhere in real life, especially in different fields of civil engineering. For example, conventional structural health monitoring (SHM) has been rapidly upgraded to sustainable SHM using artificial intelligence. It is because conventional approaches are challenged by real-time, low-cost, and quality-guaranteed SHM. In this direction, a number of innovative researches have been carried out in the Department of Civil Engineering, University of Malaya. This paper attempts to present the latest developments of SHM-based artificial intelligence in Structural Health Monitoring Research Group (StrucHMRSGroup) and Advance Shock and Vibration Research Group (ASVR). To this end, the applications of artificial neural networks, fuzzy logic, genetic algorithm, data mining, and regression analysis in SHM are presented with the aim of showing the efficiency of these methods.",
                "eval": 99
            },
            {
                "title": "Embedding Artificial Intelligence and Green Ideology in Formulating Corporate and Marketing Strategies",
                "abstract": "Artificial intelligence (AI) assists organizations with offering significant advantages to customers, for example, well-being observing with wearable gadgets, exhortation with recommended frameworks, inner harmony with brilliant family items, and comfort with voice-initiated menial helpers. Nonetheless, while AI should be visible as an impartial apparatus to be assessed on proficiency and precision, this approach doesn't consider the green ideology in formulating corporate and marketing strategies. This paper suggests practical implications that strengthen corporate image through sustainability strategies while responding to scandals like green-washing and the marketing environment that are confronted with such repeated views opposing the inclusion of green marketing and Eco-friendly consumption. This approach allows us to discuss embedding AI and green ideology in corporate and marketing strategies to address the manners by which buyers might neglect to encounter esteem in associations' interests into AI and to spread out a plan for future exploration",
                "eval": 99
            },
            {
                "title": "Building Smarter Smart Cities for Sustainable Development through Artificial Intelligence",
                "abstract": "Increasing urbanization and rapid increase of the population in urban areas has led to varied issues, to which rendering the cities as a “smart” one has been identified as a solution. The sole motive behind the intent to come up with smart cities is to incorporate technological impulses into the usual routine chores of people in a particular area, so as to enhance the living standards as well. But there is a gap regarding considering environmental preservation as an indicator of achieving sustainability in the smart city concept. Beyond the current versions of technologies utilized, Artificial Intelligence (AI), is apparently the most promising recent advancement of ICT, which can deliver the motive of sustainable development through the advent of future smart cities. AI applications can actually transform the way civilizations respond to threats of varying degrees. This paper is an effort to showcase in a combined manner, the AI based solutions, aimed at smartifying the smart cities, through focusing on enhancing the sustainable development.",
                "eval": 99
            },
            {
                "title": "Sustainability and Artificial Intelligence: Necessary, Challenging, and Promising Intersections",
                "abstract": "Both digital economy and digital technology researchers increasingly recognize the need to better address the role that artificial intelligence (AI) plays in shaping the evolution of the environmental, social and governance aspects of development. It appears that sustainability and AI research converge on the features of wicked problems that are complex, interconnected and dynamic. Building off such convergence, this article aims to map out the necessary, challenging, and promising intersections by providing an overview of the state of art research. Based on 541 bibliographic data collected from the Web of Science (WoS) database, the findings reveal the increasingly central body of work on green and sustainable science and technology in bridging various disciplines, main journals and key topics and concepts. The findings reveal how such interactions can be necessary, challenging, and promising. The article concludes with few general arguments regarding how to diversify and expand the community of practice regarding AI for sustainable development, especially in the areas of expected AI application areas and institutions.",
                "eval": 99
            },
            {
                "title": "Embedding Ethics and Trustworthiness for Sustainable AI in Earth Sciences: Where Do We Begin?",
                "abstract": "As in many other research domains, Artificial Intelligence (AI) techniques have been increasing their footprint in Earth Sciences to extract meaningful information from the large amount of high-detailed data available from multiple sensor modalities. While on the one hand the existing success cases endorse the great potential of AI to help address open challenges in ES, on the other hand on-going discussions and established lessons from studies on the sustainability, ethics and trustworthiness of AI must be taken into consideration if the community is to ensure that its research efforts move into directions that effectively benefit the society and the environment. In this paper, we discuss insights gathered from a brief literature review on the subtopics of AI Ethics, Sustainable AI, AI Trustworthiness and AI for Earth Sciences in an attempt to identify some of the promising directions and key needs to successfully bring these concepts together.",
                "eval": 99
            },
            {
                "title": "AI-Based Crop Rotation for Sustainable Agriculture Worldwide",
                "abstract": "Artificial intelligence (AI) and sustainability. Two words not commonly used in the context of crop rotation management. However, simple AI-based expert systems supporting farms' decision-making for optimizing crop rotation might be the key to solving most of the UN sustainable development goals worldwide. The essence of AI-based crop rotation and farm management is that it works with nature-not against it! Thus, the AI -based expert system needs to solve the multidimensional optimization tasks of maximizing the diversity of crops that match the local soil, local climate condition, the needs of the livestock, and any available machinery. Next to the option task, the expert system had to argue its decision-making basis since the goal is to get the most sustainable farming with the most profitable crop yield, not to get the largest yield. The expert systems' user interface (UI) should broaden thinking habits, opting for new sustainable farming perspectives. This paper will introduce both the technical architecture and the user-in-the-loop (UIL) principle of such an expert system. Since our system is still in the conceptional phase, we argue design decisions and address open research questions needed to implement such an expert system.",
                "eval": 99
            },
            {
                "title": "Keynote: AI for Scientific Discovery and a Sustainable Future",
                "abstract": "Artificial Intelligence (AI) is a rapidly advancing field.Novel machine learning methods combined with reasoning and search techniques have led us to reach new milestones: from computer vision, machine translation, and Go worldchampion level play, to self-driving cars. These ever-expanding AI capabilities open exciting avenues for advances in new domains. I will discuss our AI research for advancing scientific discovery for a sustainable future. In particular, I will talk about our research in a new interdisciplinary field, Computational Sustainability, which aims to develop computational models and methods to help balance the environmental, economic, and societal needs for a sustainable future. I will provide examples of computational sustainability problems, ranging from biodiversity conservation to multi-criteria strategic planning of hydropower dams in the Amazon basin and materials discovery for renewable energy materials. I will also highlight our work on AI to accelerate the discovery of new solar fuels materials. In this work, we propose an approach called Deep Reasoning Networks (DRNets), which requires only modest amounts of (unlabeled) data, in sharp contrast to standard deep learning approaches. DRNets reach superhuman performance for crystal-structure phase mapping, a core, long-standing challenge in materials science, enabling the discovery of solar-fuels materials. DRNets provide a general framework for integrating deep learning and reasoning for tackling challenging problems. Finally, I will highlight cross-cutting computational themes and challenges for AI",
                "eval": 99
            },
            {
                "title": "Keynote 2 - Computational Sustainability: Computing for a Better World and a Sustainable Future",
                "abstract": "Summary form only given, as follows. The complete presentation was not made available for publication as part of the conference proceedings. Artificial Intelligence (AI) is a rapidly advancing field. Novel machine learning methods combined with reasoning and search techniques have led us to reach new milestones: from computer vision, machine translation, and Go and Chess world-champion level play using pure self-training strategies, to self-driving cars. These ever-expanding AI capabilities open up new exciting avenues for advances in new domains. I will discuss our AI research for advancing scientific discovery for a sustainable future. In particular, I will talk about our research in a new interdisciplinary field, Computational Sustainability, which has the overarching goal of developing computational models and methods to help manage the balance between environmental, economic, and societal needs for a sustainable future. I will provide examples of computational sustainability problems, ranging from biodiversity and wildlife conservation, to multi-criteria strategic planning of hydropower dams in the Amazon basin and materials discovery for renewable energy materials. I will also highlight cross-cutting computational themes and challenges for AI at the intersection of constraint reasoning, optimization, machine learning, multi-agent reasoning, citizen science, and crowd-sourcing.",
                "eval": 99
            },
            {
                "title": "Sustainability Is Not Enough: Towards AI Supported Regenerative Design",
                "abstract": "Sustainability, to describe it in simpler words, is a process of making things less bad. It is not a long-term solution even if it limits the destruction of the environment to a manageable level. Nevertheless, by just becoming sustainable, one cannot bring back what has been lost. The restoration approach is immediately required to fixing what has been broken by using renewable energy, reforestation and creating biodiversity gains. Redesigning our industrial system of production and consumption around the circular patterns of resource and energy use that we observe in mature ecosystems is a must and a complex endeavour. To create a truly regenerative economy challenges us to work with huge amounts of data. New techniques of data science and artificial intelligence are required in each step of the ecological design. This paper presents some examples of biomimicry in circular design and proposes techniques that integrate data science and artificial intelligence (AI) as tools to accelerate the transition towards the regenerative approach. AI, as an emergent `Fourth Industrial Revolution' technology, can support and accelerate the pace of human innovation to design the future urban developments, to enable innovation in cities. AI has the capability to create a step change, to support an effective economic system that is regenerative by design.",
                "eval": 99
            },
            {
                "title": "HRM and Role of Artificial Intelligence: Triple Bottom Line Sustainability",
                "abstract": "The sustainability framework is inherent in the balanced scorecard, which accounts for financial and non-financial indicators, methodological challenges in developing matrices for triple bottom line performance and establishing decision support frameworks. According to our work, we are focusing on human cognition when confronted with multi-attributed platforms. The research in the field of Artificial Intelligence <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$(AI)$</tex> results in the growth and development of a wide range of sectors. Through various studies done in the past on the impact of <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$AI$</tex> it was found that <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$AI$</tex> systems will play a significant role in achieving sustainability both in positive and negative ways. Through our work, we aim to draw light and focus on reducing the shortcomings of Artificial Intelligence <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$(AI)$</tex> which were found by using the consensus-based expert elicitation process that AI has a negative impact on 59 targets of 17 sustainable development goals. Our main focus is on Three sustainability areas: Environment, Economy and Society where we worked on indicating the negative impacts of <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$AI$</tex> on various targets of 17 SDGs. Building on the balanced scorecard, many approaches to the triple bottom line are based largely on accounting and reporting. In other words, firms identify social, environmental and economic metrics and track and report performance.",
                "eval": 99
            }
        ],
        "21-30": [
            {
                "title": "The risks of AI and ethical considerations from the Human Scale Development approach",
                "abstract": "Current advances in the research, development and application of artificial intelligence (AI) systems have given rise to a far-reaching discourse on the ethics of AI and with them, the generation of several ethical guidelines comprising normative principles and recommendations. In this wide-ranging discussion, it has been considered important to broaden participation to other fields of knowledge, to enrich the considerations to be taken into account to ensure ethical principles in AI development. In this paper we broaden the discussion by presenting the Human Scale Development approach that proposes new orientations, principles and guidelines that can provide dimensions not considered with respect to the relationship of technology with humans, sustainable human-to-human relationships and mediation between humans and nature. If AI developers can keep these ideas in mind, it can be assured that AI-generated technology to meet human needs will contribute to increasing the well-being of people and the sustainable development of societies, and an AI that is at the service of humanity and the biosphere.",
                "eval": 99
            },
            {
                "title": "The change of teachers’ role in teaching under the environment of “Artificial Intelligence +”",
                "abstract": "Artificial Intelligence enabled classroom teaching is the core driving force of classroom reform in the era of information 2.0. In this process, how to understand the conflict between Artificial Intelligence and teacher's role and position the teacher's role in the new technology environment is an important basis for leading the deep integration of Artificial Intelligence and education and teaching. In this context, “man-machine collaboration” will be an important trend of future education. Artificial intelligence technology, with its application in the field of education of intelligent platform, intelligent tools, and intelligent services, has brought challenges and dilemmas to teachers' professional roles. As an assistant teacher and analyst in classroom teaching, artificial intelligence has greatly contributed to the high efficiency, accuracy, and diversity of teaching. Teachers should be the designers, decision makers and educators of classroom teaching, so as to promote the all-round development of students and make them the talents needed by the contemporary society.",
                "eval": 99
            },
            {
                "title": "Comparative Analysis on Artificial Intelligence Technologies and its Application in FinTech",
                "abstract": "Universal technology has advanced with time, and as they say, “Necessity is the Mother of Invention,” this is impacting people's attitudes. As a result, people's attitudes regarding online networks have shifted from those of cable networks, which has steadily influenced the world's adoption of new technologies. Computerized Intelligence (AI). AI will enable financial businesses to totally rethink their business models, launch cutting-edge goods and services, and, most crucially, influence customer experience initiatives. In this second machine age, banks will face competition from nimble fintech startups that use cutting-edge technologies to supplement or even replace human labor with complex algorithms. Banking businesses will need to accept AI and use it into their business plan in order to keep a strong competitive advantage. As human selection is expensive, AI and ML are replacing human analysts in corporate tasks. Since AI is built on ML, it learns over time and provides the utmost accuracy in calculations and data analysis. AI also has the ability to introduce process automation to many industries as needed, as well as smart analytics and clear thought. AI-powered Chat-Bots have established themselves as a viable customer service tool, and because they save businesses time and money, they appear to be an uncomposable resource. The investments are a major part of the finance sector and taking in account of the investments prediction by the artificial intelligence algorithms and a comparison between them is the main motive behind this paper.",
                "eval": 99
            },
            {
                "title": "Land Resource Management Information Platform Based on Artificial Intelligence Technology",
                "abstract": "Cloud computing, big data and artificial intelligence have become the hot spots in the current information system construction, and the integration of artificial intelligence into the information management platform has become a new means. This paper mainly studies the land resource management information platform based on artificial intelligence technology. In this paper, the concept of artificial intelligence is first described. Secondly, combined with the key technologies and daily business requirements, the system requirements analysis was completed, and the specific functional requirements of the platform were deeply analyzed through the use case diagram. Thirdly, combined with the system design principles, the system logic structure and function module design are completed. Finally, combined with the system design and implementation, the system test is completed from the two aspects of system function test and performance test. The results of function test and performance test show that the land resource management information fully meets the expected design requirements and all the performance indicators meet the requirements.",
                "eval": 99
            },
            {
                "title": "Research on Intimacy between Teachers and Students in English Classrooms in the Context of Artificial Intelligence",
                "abstract": "This article mainly describes the development process of artificial intelligence (AI) and the full range of opportunities that exist in the process of empowering English education.In the field of education, educational objectives, educational content, educational process and educational mode will be reformed and reshaped.The intimacy between teachers and students will inevitably change. Teachers must change their concepts, learn to teach collaboratively with artificial intelligence, learn for life, and be charming teachers in order to construct a new type of teacher-student relationship.",
                "eval": 99
            },
            {
                "title": "Unravelling the Myth of big data and artificial intelligence in sustainable natural resource development",
                "abstract": "Natural Resources businesses span one or more of the following verticals: Explore & Discover, Develop, Extract & Transport, Market & Trade. Natural Gas (NG) is a key component of the Natural Resources industry, which contributes both directly and indirectly to sustain and support the day to day energy needs of humans. Various forums drive key initiatives to maintain the sustainability of natural resources for decades to come. The recent evolution of advanced Information Technology (IT) fields, termed as `Big Data and Artificial Intelligence (BD&AI),' fortify these initiatives by providing anytime, anywhere access of data (for example in remote offshore assets or facilities) from a vast corpus base, in addition to enabling natural human interaction. In this paper we intend to explore the key primitives of BD&AI and cite the method of real-world implementation in the Natural Gas industry to further enable sustainable development.",
                "eval": 99
            },
            {
                "title": "Artificial Intelligence (AI) in the Automotive Industry and the use of Exoskeletons in the Manufacturing Sector of the Automotive Industry",
                "abstract": "Introducing Artificial Intelligence (AI) in the Automotive Industry and developing related technologies will significantly impact the automotive industry. A technological innovation like Autonomous driving entails using artificial intelligence (AI), which represents the future of transportation and applications that will influence the concept of driving. New businesses related to mobility will emerge, and the already existing ones will have to adapt to the necessary shifts. Some security and AI algorithms are used in the vehicle security domain. This research aims to give some idea and understanding about how Artificial Intelligence (AI) is important and impacts the automotive industry. While discussing autonomous vehicles, there is a question to ask or focus on – what about the feasibility of autonomous production? Some light has been thrown on the benefits and requirements for automation of production plants, and its future has been discussed.",
                "eval": 99
            },
            {
                "title": "Artificial Intelligence as Enabler for Sustainable Development",
                "abstract": "When the UN published the 17 Sustainable Development Goals (SDGs) in 2015, emerging technologies like Artificial Intelligence (AI) were not yet mature. However, through its deployment across industry sectors and verticals, issues related to sustainability, fairness, inclusiveness, efficiency, and usability of these technologies are now priorities for global consumers and producers. This paper discusses what needs to be considered by both policy makers and ‘managers’ in order to exploit the use of AI for SDG achievement. AI can act as a real and meaningful enabler to achieve sustainability goals; however, it may also have negative impacts. Therefore, a carefully balanced approach is required to ensure that Artificial Intelligence systems are employed to help solve sustainability issues without inadvertently affecting other goals.",
                "eval": 99
            },
            {
                "title": "Impact of Artificial Intelligence in Basic General Education in Ecuador",
                "abstract": "The information and knowledge society leads to urgent changes in the world's educational systems. These changes must go hand in hand with new technologies and intangible services, education must focus their education for the jobs of the future. Education is one of the fundamental pillars in the advancement and progress of people, according to UNESCO, education can and should contribute to a new vision of sustainable world development. Artificial Intelligence in education currently offers a range of possibilities to both the teacher and the student in the teaching-learning process. According to UNESCO, Artificial Intelligence has the power to transform education. This article makes a study of Artificial Intelligence and how it is related to education; an analysis of the basic general education curriculum in Ecuador, as well as the importance of the use of tools based on Artificial Intelligence that contribute to strengthening the teaching-learning process.",
                "eval": 99
            },
            {
                "title": "Creating an Immersed Sheep and Wool VR/AI Experience",
                "abstract": "The development of a sheep and wool conservancy initiative, \"Shave 'em to Save 'em,\" inspired the creation of a Virtual Reality/ Artificial Intelligence game \"For Ewe,\" a proof-of-concept game. It aims to support agricultural and sustainable design initiatives. The game development process was guided by Activity Theory and was created using Unity 3D. \"For Ewe\" was tested on web, Samsung Gear VR, and Oculus Quest virtual reality platforms.",
                "eval": 99
            }
        ],
        "51-60": [
            {
                "title": "Keynote Speech IV: Towards Building the Egyptian Artificial Intelligence Ecosystem",
                "abstract": "Summary form only given, as follows. The complete presentation was not made available for publication as part of the conference proceedings.. In 2015, the United Nations announced a new set of Sustainable Development Goals (SDGs). Information & Communication Technologies (ICTs) are recognized as one of the main pillars to achieve the SDGs and building the global economy through innovations and jobs creation. In fact, the knowledge economy has a great potential to promote the economic growth especially for the developing countries.The fast implementation of Information & Communication Technologies such as Digitization, Robotics, Internet of Things (IoT), Artificial Intelligence (AI), and Nano & Bio Technologies has led to the fourth industrial revolution. Industry 4.0 is the blending of those technologies which affects the global political, social, and economic systems. In this talk, we will provide the main guidelines for building a holistic Egyptian strategy to join the industry 4.0 era, especially in the field of Artificial Intelligence.This strategy can support Egypt to gain a competitive advantage in the global knowledge economy as one of the contributors in the AI field. As well as, helps Egypt to generate investments and to be considered as a hub for the AI systems, and highly compete in the areas of research and development in the region.",
                "eval": 99
            },
            {
                "title": "The Transformation and Development of Vocational Education in the Age of Artificial Intelligence",
                "abstract": "Artificial intelligence, as a universal technology that supports the transformation of all industries, promotes changes in various fields such as politics, economy, and society. Naturally, it also puts forward the requirements of transformation and innovation for the development of vocational education. This article explores the transformation and development of vocational education in the era of artificial intelligence in order to promote the ecological development of vocational education in my country. This article understands the status quo and changes of the development of vocational education in this profession by issuing questionnaires to the teachers and students of the professional robotics profession in A vocational colleges. It is concluded that 86.42% of teachers and students believe that the major is now more focused on training comprehensive talents; 93.71% of teachers and students believe that this major is now more concerned about the development of future society, and put forward the development strategy of vocational education in the era of artificial intelligence. The research in this article will help vocational colleges optimize their talent training programs and keep up with the development of the times to achieve the sustainable development of colleges.",
                "eval": 99
            },
            {
                "title": "Artificial Intelligence System based Embedded Real-Time System Power Optimization and Adaptability",
                "abstract": "This research study focuses on finding solutions to the emerging challenges in the embedded systems' power consumption optimization. First, the challenges in physical CMOS power consumption are analyzed and further various real-time limitationsand load characteristics are explored. Further, various power consumption techniques are considered by including DMP, DVS/DFS, AVS, and ABB. Issues with organising a feedback and determining adaptability for various embedded systems are investigated.",
                "eval": 99
            },
            {
                "title": "Marketing 5.0. Transactions of Artificial Intelligence Systems in The Digital Environment",
                "abstract": "The subject of the article is a study of the opportunities that AIS would provide to humanity and its significance for marketing 5.0. The object of this article is AIS understood as an independent participant in the digital markets.",
                "eval": 99
            },
            {
                "title": "Explainable Residual Network for Tuberculosis Classification in the IoT Era",
                "abstract": "Tuberculosis (TB) is a lung disease that tops the world mortality rate. The widely employed method of diagnosis is the X-ray images which gives the pictorial information of the lungs. In the era of the Internet of Things (IoT), Artificial Intelligence (AI) using deep learning is among the most efficient methods in detecting lung-related diseases, and in classifying the related X-ray images. To trust the achieved decision, in this study ResNet-50 was used to classify TB and normal patients X-ray images, also, a Gradient-weighted Class Activation Mapping (Grad-CAM) was used to extract the features of the last pooling layer of the ResNet model to know what makes the model classify the X-ray images based on the given classes.",
                "eval": 99
            },
            {
                "title": "Cyber Security Integration with Smart New Age Sustainable Startup Business, Risk Management, Automation and Scaling System for Entrepreneurs: An Artificial Intelligence Approach",
                "abstract": "Artificial Intelligence and cybersecurity play a crucial role in the success of a new-age sustainable startup business. In terms of risk management, Artificial Intelligenoe can be used to detect and prevent cyber threats, while also providing valuable insights into potential vulnerabilities. Automation can also improve the efficiency of security processes and help scale the business. However, entrepreneurs must be aware of the potential risks associated with AI and cybersecurity, including the possibility of data breaches and ethical issues. Strong security measures, such encryption and routine software updates, as well as knowledge of the laws and policies governing AI and cybersecurity are necessary to mitigate these dangers. A systematic literature review has been done in this paper. This paper provides an overview of new-age sustainable startup businesses and the importance of emerging technologies in new-age sustainable startup businesses, risk management, automation and scaling of entrepreneurs. Further, this paper tells about the impact of AI and Cyber Security in new age sustainable startup businesses. The advantages and challenges of Artificial Intelligence and Cyber Security in a new-age sustainable startup business are also discussed.",
                "eval": 99
            },
            {
                "title": "Enterprise Brand Marketing Strategy under the Background of Artificial Intelligence",
                "abstract": "In the 21st century, social changes and development are rapid, all of which are closely related to science and technology, and are gradually integrated into all aspects of society. Since 1956 in the last century, artificial intelligence technology has developed rapidly. Today, artificial intelligence has spread to all aspects of economy, society, the rule of law and the humanities, and has had a profound impact on mankind. Since the reform and opening up, my country's small and medium-sized enterprises have developed rapidly. They have now become an important part of our country's market economy. Small and medium-sized enterprises play an important role in absorbing labor and employment, and in activating the market economy to meet social needs. This article chooses the corporate brand marketing strategy as the research topic. First, according to the current industry and market environment, the implementation of artificial intelligence in the marketing industry and the future development trend are explained. The company’s brand marketing strategy is analyzed through artificial intelligence; secondly, combined with the development status of artificial intelligence and application cases in commercial marketing, it analyzes technical capabilities, application scenarios, implementation results, and existing problems and other internal resource elements. The advantages and disadvantages, opportunities and challenges of artificial intelligence development in brand marketing at this stage, and highlight the insufficient investment cost, lack of core technology and insufficient corporate brand marketing talents; finally, based on the overall diagnosis of artificial intelligence development, the enterprise development is proposed strategy. The strategic positioning and gradual strategic goals of the brand's future marketing development, and proposed safeguard measures.",
                "eval": 99
            },
            {
                "title": "Estimation of Energy Performance Classes of Concrete Structures with Artificial Intelligence Models",
                "abstract": "The construction sector is one of the sectors that make energy efficiency a must. In almost every field related to the construction sector, there is a need for studies in which high performance can be achieved by including artificial intelligence in energy. In this study, energy class models, which are an area of artificial intelligence, which show the efficiency level of energy systems that determine the energy performance of buildings, are examined.",
                "eval": 99
            },
            {
                "title": "Industry 4.0 and Next Normality in Ensuring Sustainable Development",
                "abstract": "In the research, information about the features of the development of the world's economies based on Next Normality and Industry 4.0 is given. The prerequisites for stimulating the transition of national economies to the principles of Next Normality are revealed. This will ensure the sustainable development of society in overcoming the new global economic crisis. The use of Industry 4.0 technologies (Cloud Technologies, Artificial Intelligence and others) for processing big data and creating forecasts at different levels: the world, countries, enterprises, equipment operation and others was justified. Reasonable recommendations for the development of the national economy of Ukraine based on Industry 4.0 in the context of Next Normality are offered.",
                "eval": 99
            },
            {
                "title": "A Novel Artificial Intelligence Inspired Approach for Analysing Sentiments using Neural Network",
                "abstract": "Sentiment Analysis is a text classification system used to analyse the incoming text and determine if the sentiment evolved from the argument text is positive, negative or neutral. It holds specific significance in different areas of Technology and it has varied applications. It combines the power of two most significant fields of Artificial Intelligence, viz. Deep Learning and Natural Language Processing. Deep Learning has evolved as an advanced and efficient technology to target and solve real-world problems with greater accuracy and efficiency. Neural Networks are used to deal with enormous amounts of data without any considerable domain engineering and adapt from its own method of computing. Sentiments within a text can become misleading if the whole sentence is taken as a collection of independent words, since each and every word is connected to other in some sense. This research is used to propose and develop an efficient model that can analyse the sequential sentiments with greater prediction and accuracy. This research also compares the prediction accuracy of the proposed model with other existing novel methods.",
                "eval": 99
            }
        ],
        "101-110": [
            {
                "title": "A Detailed Investigation on Potential Impact of Quantum Computing on Improving Artificial Intelligence",
                "abstract": "Quantum computing is an emerging technology (QC). Several groups and research institutions are working to make quantum computing applications a reality. Artificial Intelligence (AI) is another emerging field that is becoming more established over time. The main goal of this research is to figure out how the advancement of quantum computing technology will affect AI applications. Computational methods are used to explore the growing influence of quantum computing development for a specific AI application. This study also discusses about the impact and potential of Quantum Computing (QC) on Artificial Intelligence (AI). These can be accomplished by employing cutting-edge methods to deliver usable, economically viable, and scalable technology across a wide range of industries. On the other hand, the risk of committing errors in quantum algorithms, as well as the inability to function without being super-cooled, emerges as a major challenge. Macro-energy systems and the development of sustainable energy materials are just two areas of science and engineering that quantum computing has the potential to completely transform.",
                "eval": 99
            },
            {
                "title": "Signaling Sustainable Robotics – a Concept to Implement the Idea of Robotic Governance",
                "abstract": "Labeling is today a common way to signal certain characteristics of consumer products, especially in the fields of organic and environmental production. Nevertheless, the basic concept ab labeling as a way to inform the customer or user and the use of certification to establish a regulating market-mechanism are not limited to these cases. In this paper, we propose the adaption of labeling as a method to foster \"Robotic & AI Governance\", a concept of self-regulation for robotics, automation and artificial intelligence (7)(10)(25)(26)(27).",
                "eval": 99
            },
            {
                "title": "Artificial intelligence and sensors based assistive system for the visually impaired people",
                "abstract": "The need for developing a low-cost assistive system for the visually impaired and blind people has increased with steady increase in their population worldwide. The stick system presented in the paper uses artificial intelligence along with various sensors in real time to help the visually disabled people to navigate their environment independently. Image recognition, collision detection and obstacle detection are the three tasks performed by the system. The image recognition task was performed using a smartphone application powered by artificial intelligence. The tasks of collision detection and obstacle detection utilized ultrasonic sensors to alert the user of the obstacles appearing in his route. The stick system also managed to demonstrate the important characteristics of affordability, high efficiency, mobility and ease of use.",
                "eval": 99
            },
            {
                "title": "Effectiveness of Artificial Intelligence Based Recruitment process in the Employment of Indian Hardware Industry",
                "abstract": "Artificial intelligence (AI) inference in human resource management, especially in the recruiting process, was discussed in the paper. The study's aim is to learn whether artificial intelligence will replace human participation in the recruiting process in a few Indian hardware companies. The modern method of recruiting has supplanted the old method of recruitment. AI is ushering in the new phase of recruiting. Via numerous outsourcing firms, AI-based recruiting is being introduced into top businesses, and a few companies are privately playing with it. This study focuses on using AI to help understand the multiple factors for exclusion and what emotional intelligence requirements are considered. When the cause for rejection has been established, the skills and other criteria will be applied in a manner that can turn the rejection into a benefit. All the data are gathered from secondary sources such as newspapers, blogs, websites, and academic papers. Artificial intelligence has a positive impact on human succession in the recruiting process, according to the report. Meanwhile, the research is intended to assist the organizations being analyzed in formulating management plans and policy interferences in order to create an efficient recruitment method for recruiting efficient teams in order to compete in the marketplace and develop a viable atmosphere. The content of the study is to bring up a software which can guide HR on Selecting Staff.",
                "eval": 99
            },
            {
                "title": "5G Core Network Framework Based on Artificial Intelligence",
                "abstract": "The fifth generation mobile communication (5G) core network refers to the service-based architecture, which poses a great challenge to the traditional operation and maintenance. Network artificial intelligence is an important direction of technology development. Based on researching progress of the related standards about network intelligence, this paper proposes a novel intelligent operation architecture of 5G core network, and introduces the key features. Then we study intelligent application scenarios, and discuss the opportunities and challenges of realizing intelligent 5G network.",
                "eval": 99
            },
            {
                "title": "Artificial Intelligence’s Contribution To Mental Health Education",
                "abstract": "As AI offers a suitable response to various challenges associated with this disease, it plays a crucial role in mental health. A fundamental concept of the AI-based mental health remedy and its impact on directly affecting social-emotional learning has also been examined in this study with the appropriate material and references. The many types of AI that may unquestionably aid in general mental health education have already been specifically outlined in this research using all the data from existing books and publications. In addition to this, an AI-based chatbot platform has been built within the software system to identify various health factors that seem to be directly linked to mental health. The main challenges in this regard remained consistent with other AI-related healthcare systems including concerns for privacy and confidentiality apart from data integrity.",
                "eval": 99
            },
            {
                "title": "Overview of the Relationship between Mechatronic Engineering and Artificial Intelligence",
                "abstract": "The improvement of the development level of mechatronics engineering in the new era has played an important role in promoting the improvement of social production conditions and the increase of productivity. In this context, it is necessary to pay attention to the application of intelligent control engineering and artificial intelligence in order to increase the technical content of mechatronics engineering and improve the level of intelligence in this type of engineering practice. Focusing on the development of mechatronic engineering on AI trend and provide effective technical support for sustainable development can help the production lines to meet the diverse needs of related production practices. In view of this, the article systematically elaborates based on the application of intelligent control engineering and artificial intelligence in mechatronic engineering and gives several real examples of practice applications. It can be a reference for related researchers.",
                "eval": 99
            },
            {
                "title": "Doctor Patient Assistance System Using Artificial Intelligence",
                "abstract": "The world is digitizing, and many chores, such as bank transactions and internet payments, are being digitized as a result. With the advancement of technology, we may also consider digitizing doctor-patient interactions in order to avoid personally consulting a doctor. This paper suggests a diagnostic conversation by utilizing artificial intelligence to better identify the illness before a doctor's appointment and include specific knowledge regarding the disease. This would increase the insurance expenses, improve the exposure of a larger population to treatment, and expand the exposure of a broader community to medical assistance. Some chatbots function like a medical guidebook and will help patients/doctors search for knowledge about any illness, but to profit entirely from a chatbot, all necessary tools must be used in order to support them identify and include the details required for disease detection. Both remedies and signs for the actual disease are not known by the average layman. With certain things that do not create any pain, this chatbot does not travel to a hospital directly with checks, because it might be a waste of time. The chatbot uses NLP to master the human language, which aims to grasp patients' health issues. The patient will raise questions dependent on healthcare without needing to travel to a doctor or clinic.",
                "eval": 99
            },
            {
                "title": "Artificial Intelligence and Augmented Reality driven Home Automation",
                "abstract": "Living in an age of rapid digitization where technology has infiltrated every field there is, and our homes are no different. Internet of Things, Artificial Intelligence and Augmented Reality are in the boom, now more so than ever, highly popular among both giant corporations and aspiring young engineers, especially because of the continuous experimentations that are being done and the success it has been garnering. In this project, Raspberry Pi is the heart of the setup, to which various electronic components are connected. By giving voice-activated commands, you can remotely operate them with just the use of your smartphone, this setup also includes a Gas sensor which will effectively detect any leakage of cooking gas and promptly inform the residents of the house with a voice alert and turns on the exhaust automatically; Doors that can open or shut as and when you wish. Taking this to a whole another level is the use of Augmented Reality by Image Processing-through which we are able to simply point our smartphone at an object, which will be processed, recognized, matched to the database and correspondingly be able to perform either of the toggle operations. Our major goal was aimed at making this project accessible to everybody despite any physical shortcomings or impediments.",
                "eval": 99
            },
            {
                "title": "Artificial Intelligence based Efficient Phenotyping for Agronomics",
                "abstract": "The evaluation of soil and plants has been a costly, labor-intensive, and time-consuming process traditionally. With the advancements in technology, the phenotypic variations in plants and their corresponding information can be extracted efficiently using IoT, WSN, and computer vision and processed with machine learning, artificial intelligence, and such cutting-edge techniques. This can help in accelerating the developments in vegetation, improving the genomic selection, and enable high-throughput plant phenotyping. In this work, the phenotypic characteristics of the crop and the soil conditions are assessed using deep learning convolutional neural networks based on the data obtained by the IoT sensors and multispectral imaging from small Unmanned Aerial Vehicles (UAVs) across the agricultural area. The plant quality and leaf diseases are identified. 99.9% precision and recall are obtained with an overall accuracy of 95%. This technique is quick, cost-effective, and reliable.",
                "eval": 99
            }
        ]
    }
}